{"2024-python-refresh":{"title":"2024 python refresh","links":["tags/7dit"],"tags":["7dit","dit"],"content":"Outline For The “short Script”\nMine is Not Short at all but it cover the rest of the requirements of the other challenges. For those who Know its the first question in the python refresher for7dit . The brief “Write a program that asks the user to input a number. Then, print your full name that number of times.”\nCode\nmain.pydef input_and_check(prompt: str, expected_type: type, none_able=False) -&gt; any:\n    possible_types: list = [int, float, str]\n \n    try:\n        input_val: str = input(prompt)\n \n        for i in possible_types:\n            if i is expected_type:\n                return i(input_val)\n \n        if none_able or (type(input_val) is None) or (input_val == &quot;&quot;):\n            raise ValueError(&quot;Input Does Not Match The Expected Type!&quot;)\n        else:\n            raise ValueError(&quot;Input Is Empty When Not Alowed&quot;)\n    except ValueError as error_code:\n        return error_code\n \n \ndef main() -&gt; None:\n\twhile True:\n        try:\n            name\n        except NameError:\n            name = input_and_check(\n                prompt=&quot;whats Your Name? &gt; &quot;,\n                expected_type=str,\n                none_able=False\n            )\n            if type(name) is ValueError:\n                del name\n                pass\n        try:\n            number_loops\n        except NameError:\n            number_loops = input_and_check(\n                prompt=&quot;think of a number 1 or higher &gt; &quot;,\n                expected_type=int,\n                none_able=False\n            )\n            if (type(number_loops) is ValueError):\n                del number_loops\n                pass\n            elif (number_loops &lt; 1):\n                print(f&quot;{name} You have to input a number higher&quot;)\n                del number_loops\n                pass\n        break\n \n    for i in range(number_loops):\n        print(f&quot;Hello {name}&quot;)\n \n \nif __name__ == &quot;__main__&quot;:\n    main()"},"6sce-mock":{"title":"6sce mock","links":[],"tags":["6sce"],"content":"Q1\na) correct\na=ΔtΔv​\na=30s​60ms​\na=2ms−2\nb) correct\nScore: E1\nc)\ni) correct\nScore: A2\nii) correct\nFw​​=mg=770kg×10kg−1=7700N​​\nScore: A3\niii) wrong\nquestion 2\nc)\nthe car was lifted 150 cm over a period of 30 seconds. Calculate the power output of the crane used to pull the car up\nF​=mg=1500×10Nkg−1=15000N​​\n\nW​=Fd=15000N×1.5m=22500J​​\n\nP​=tW​=30s22500J​=750W​​\n"},"7CHE/Practice-Report-2":{"title":"Practice Report 2","links":[],"tags":["7che"],"content":"Mystery cat-ion solution was mixed with NaOH a white precipitate was formed. Then, as an excess of NaOH was added, and perpetrate remained. This confirms the presence of Magnesium (Mg2+). The formula that supports this OH(aq)−​+Mg(aq)2+​→MgOH(s)​ this is proven by the solubility rule “Hydroxides are insoluble except; Alkali metal hydroxides are soluble. [Ba2+, Sr2+, Ca2+, Tl+] are considered slightly soluble”. Now that we have identified Mg2+ what are the effects on humans."},"7CHE/Practice-report":{"title":"Practice report","links":[],"tags":["7che","chem"],"content":"Testing Cations [Cu2+,Fe2+,Fe3+,Ag+,Pb2+,Mg2+,Ba2+,Al3+,Zn2+,Na+]cd\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTestObservationsions eliminatedNames and/or formula of preciptates that form.equations for formation of precipitatesAdd NaOHOrange PreciptateCu2+,Fe2+...Iron(III) HydroxideFe3++OH→Fe(OH)3​Add KSCNBlood red PreciptateFe2+...Iron(III) thiocyanateFe3++SCN−→[FeSCN]2+\nWe added a NaOH solution to the mystery solution, a Orange precipitate formed as NaOH was added. This shows me that the solution is most likely Fe3+ because of the color of the precipitate. Formula for this reaction was (Fe3++OH→Fe(OH)3​). Next, we added a KSCN to a fresh sample of the mystery solution; When it was added, a blood-red precipitate formed. We saw a blood red precipitate this proves that this compound is Fe3+. The formula used to reach this conclusion was (Fe3++SCN−→[FeSCN]2+)."},"7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-1":{"title":"DailyLog 1","links":[],"tags":["7dit","dit"],"content":"What Have I Done\n\nI set up this documentation\nI created the GitHub repo\nInit the rust project\nfinaly I have made a item struct for containing all items on the menu\n\nItem Struct\nMy Awesome Structuse core::fmt;\nuse std::fmt::Display;\n \npub struct Items {\n    pub food: Vec&lt;String&gt;,\n    pub drinks: Vec&lt;String&gt;,\n    pub sides: Vec&lt;String&gt;,\n}\n \nimpl Items {\n    /// # New instance function\n    /// @prams: None\n    /// @return: instance of type\n    pub fn new(food: Vec&lt;String&gt;, drinks: Vec&lt;String&gt;, sides: Vec&lt;String&gt;) -&gt; Self {\n        Self {\n            food,\n            drinks,\n            sides,\n        }\n    }\n}\n \nimpl Display for Items {\n    /// # Implementation of Display on Items type\n    /// Allows the type Items to be printed / displayed\n    fn fmt(&amp;self, f: &amp;mut fmt::Formatter) -&gt; fmt::Result {\n        let mut output: String = String::from(&quot;Item: (food: [&quot;);\n \n        if self.food.len() != 0usize {\n            for i in &amp;self.food {\n                output.push_str(format!(&quot;{}, &quot;, i.as_str()).as_str());\n            }\n            output.replace_range((output.len() - 2).., &quot;&quot;)\n        }\n        output.push_str(&quot;], drinks: [&quot;);\n \n        if self.drinks.len() != 0usize {\n            for i in &amp;self.drinks {\n                output.push_str(format!(&quot;{}, &quot;, i.as_str()).as_str())\n            }\n            output.replace_range((output.len() - 2).., &quot;&quot;)\n        }\n        output.push_str(&quot;], sides: [&quot;);\n \n        if self.drinks.len() != 0usize {\n            for i in &amp;self.sides {\n                output.push_str(format!(&quot;{}, &quot;, i.as_str()).as_str());\n            }\n            output.replace_range((output.len() - 2).., &quot;&quot;)\n        }\n        output.push_str(&quot;])&quot;);\n \n        write!(f, &quot;{output}&quot;)\n    }\n}\nI had to implement the Display for the struct for it to display anything when printed. was simple to do though."},"7DIT/AS-91896-Coding-Project-2.7/Liams-Level-2-Python-Project":{"title":"Liams Level 2 Python Project","links":["7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-1"],"tags":["7dit","dit"],"content":"Liams Level 2 Python Project\nProject Description\nCreate a Order system for a small bisness to display daliy earning profit excetra …\n\n\n                  \n                  Key Specifications \n                  \n                \n\nAdd orders\nremove orders\ndescibe each item acording to predefined menu\nadd custom item support\ndisplay the end of day resaults\n\n\nDaily Log\n\n\n                  \n                  Info\n                  \n                \nEach time you work on your project, add a dated entry to this section. Include brief details of what you did and any problems you encountered. Include screenshots of code and output.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nlogsLog 1Transclude of DailyLog-1\n\nFinal Project Files\nCode\n\n\n                  \n                  Info\n                  \n                \nInclude 2 versions of your final project:\n\nIn .py format (file name: your-name.py)\nA link to your CodeHS sandbox/repl for this project\n\n\nGithub Repo\nTesting Plan\nMy testing plan (ctrl + k to add a hyperlink if you would like. Make sure the linked document is shared publicly)\nTesting Video\nADD VIDEO HERE\n\nHanding In Your Work\n\n\n                  \n                  Info\n                  \n                \nUse this checklist to ensure you have met key task requirements before handing in your project\n\nMy program uses all of these concepts:\n\n  Variables of at least 2 data types\n  If statements\n  Loops\n\nAnd at least two of the following:\n\n  Modifying data stored in lists (or arrays, dictionaries)\n  Storing multidimensional data in collections (2D lists)\n  Creating functions which use parameters and/or return values\n\nI have fully completed all project documentation, including:\n\n\n  Project description\n\n\n  Key specifications\n\n\n  Daily log\n\n\n  Testing plan\n\n\n  Testing video with narration\n\n\n  I have shared all documents so that my teacher can access them\n\n\n  My program includes comments\n\n\n  I have checked my code meets all PEP8 conventions by using this tool\n\n\n  I have saved my code as a .py file with an appropriate file name\n\n\n  I have embedded a link to my repl on this page\n\n\n💡 Authenticity Declaration\nI confirm that, for this project:\n\n  All of the work submitted is my own\n  I have not used AI generated code\n  I understand that I may be asked to explain the functionality of my code, and a reasonable level of understanding must be evident to meet the requirements of the Achievement Standard\n\n\n\n                  \n                  Info\n                  \n                \nOnce you have completed everything in this checklist, you are ready to hand in your work. Submit your work by email to your teacher. In your email, include:\n\n\nA link to this page (make sure it is shared to web)\n\n\nA PDF version of this page (scale to 70%)\n\n\n"},"7DIT/cool-class":{"title":"cool class","links":[],"tags":["7dit","dit"],"content":"This A Sick Class…"},"7ENF/BrainJack-Chapters/1.-Dirty-Tricks":{"title":"1. Dirty Tricks","links":[],"tags":["7enf"],"content":"Characters\n\nSam is introdused as a senior at high school who hacks for fun.\nFargas is Sam’s buddy who helps Sam with his hacking hobby.\n\nMain Points\nSam is introduced as making his way to a spot where they are going to hack. Sam, along the way, has to avoid beggars and during this self pined in to gamers alleyway by dogs. Once he makes it to the spot, he pulls out a gadget to hack his next target."},"7ENF/BrainJack-Chapters/2.-Telecomerica":{"title":"2. Telecomerica","links":[],"tags":["7enf"],"content":"Characters\n\nFragas is watch Sam From outside\nSam is in the coffie shop next to Telecomerica\n\nMain Points\nSam has posted up in the coffee shop next to Telelcomerica. He proceeds to hack their network changing the database. The staff of Telelcomerica realise what’s happening and try to catch him, but before they do, he’s waltz off down gone… Before the get the chance to catch him Sam arrives late to school."},"7ENF/BrainJack-Chapters/3.-Chaos":{"title":"3. Chaos","links":[],"tags":["7enf"],"content":"Characters\n\nSam: Walking into school\n\nMain Points\nThe down fall from the telecom database delletion cause mass panic. The computer virus spread down the coast lots of things broke"},"7ENF/BrainJack-Chapters/4.-URSULA":{"title":"4. URSULA","links":[],"tags":["7enf"],"content":"Characters\n\nSam: At his apartment\nFragas: At sam’s apartment\nGroup Of Bullies: Walks past Sam’s apartment\n\nMain Points\nThey recive there package containing there new nuro-tech headsets as they recive the package a group of bullies walk past and pester them. They then proseced to try them out and are greted with a computer assistant; This computer assistant gives them task to do that alow the device to learn what brain waves do what specificly beta brain waves."},"7ENF/BrainJack":{"title":"BrainJack","links":["7ENF/BrainJack-Chapters/1.-Dirty-Tricks","7ENF/BrainJack-Chapters/2.-Telecomerica","7ENF/BrainJack-Chapters/3.-Chaos","7ENF/BrainJack-Chapters/4.-URSULA"],"tags":["7enf"],"content":"Chapters\nChapter 1\n\n\n                  \n                  Dirty Tricks \n                  \n                \nTransclude of 1.-Dirty-Tricks\n\n\nChapter 2\n\n\n                  \n                  Telecomerica \n                  \n                \nTransclude of 2.-Telecomerica\n\n\nChapter 3\n\n\n                  \n                  Chaos \n                  \n                \nTransclude of 3.-Chaos\n\n\nChapter 4\n\n\n                  \n                  Ursula \n                  \n                \nTransclude of 4.-URSULA\n"},"Html-tags":{"title":"Html tags","links":[],"tags":["6dit","web","dit"],"content":"“ paragrph\n&lt;p&gt;\n\ttext goes here.\n&lt;/p&gt;\n&lt;div&gt; devider\n&lt;div&gt;\n\ttext and elements go here\n&lt;/div&gt;\n&lt;style&gt; style tag for css in file\n&lt;style&gt;\n\t.body{\n\t\t/* styling can go here. */\n\t}\n&lt;/style&gt;\n&lt;img&gt; image tag\n&lt;img src=&quot;link or path to image&quot; alt=&quot;what shows on hover &quot;&gt;\n&lt;a&gt; link tag\n&lt;a href=&quot;sub.fqdn.tldn&quot;&gt;the link text&lt;/a&gt;\n&lt;em&gt; same as * * in markdown its italics\n&lt;em&gt; emthsized text (italics)\n&lt;ul&gt; unordered-list\n&lt;ul&gt;\n\t&lt;li class=list_class&gt;item&lt;/li&gt;\n\t...\n&lt;/ul&gt;\n&lt;li&gt; list item\n&lt;ul&gt;\n\t&lt;li class=list_class&gt;item&lt;/li&gt;\n\t...\n&lt;/ul&gt;\n&lt;br&gt; break or line break same as \\n\ntext on the first line &lt;br&gt; now im on the second line \n&lt;iframe&gt; for embeds or including other websites\n&lt;iframe id=&quot;inlineFrameExample&quot;\n    title=&quot;Inline Frame Example&quot;\n    width=&quot;300&quot;\n    height=&quot;200&quot;\n    src=&quot;link to embed&quot;&gt;\n&lt;/iframe&gt;\n&lt;ol&gt; ordered list\n&lt;ol&gt;\n\t&lt;li class=list_class&gt;item&lt;/li&gt;\n\t...\n&lt;/ol&gt;"},"L2-Mechanics/Task-A":{"title":"Task A","links":[],"tags":["7phx"],"content":"Task\nImage\n\nTask Details\nIdentify and describe the forces acting on a dog on a lead. Draw a free body diagram and a vector diagram calculate the horizontal and vertical components of the force, if the tension force is 10 N and the angle is 30 degrees.\nMy Answer\nDiagram\n\nMath\nSolved for the x and y components of the vector.\nFx​\nsin(θ)sin(30)sin(30)×10N5​=O/H=O/10N=O=O​​\nFx​=5\nFy​\ncos(θ)cos(θ)×Hcos(30)×10N8.66(3sf)​=A/H=A=A=A​​\nFy​=8.66(3sf)"},"Ncea-3.7-Assesment-Project-Proposals":{"title":"Ncea 3.7 Assesment Project Proposals","links":["kuberneties"],"tags":["dit"],"content":"API\nI could make a Web Api using Python and Module i have had some time with FastApi. I have spent a fair amount of time with kuberneties Witch i can use to deploy the app to a public domain. I could also build a frontEnd/user Interface for this api."},"cellular-reproduction":{"title":"cellular reproduction","links":[],"tags":["6sce","bio"],"content":"binary fission\nbinary fision; binary meaning x^2 as when it splits the posible population incenses by a factor of x^2\n\nExplaintion\n\nIn this stage of the life cycle is where the Dna or more specifically the nuleoid is replicated for use in the replica cell. The copy of the nucleoid is a 1 for 1 match as it can be this mean there is no perent as each cell is just as much of the cell as the one is split off.\nThe cell starts to enlarge in this process it would be producing more of other organales e.g. plasmids ribosomes and others this way there are more resources for whent the cells split the resources in half.\nThe cell has grown to the point of witch it now starts to seal the two cell off getting ready to split from one another. \nThe cell now has sealed and the membrain and cell wall have closed at this stage it is almost time for the cells to split from one another.\nThe cells now have finally split into 2 from the before 1 importantly these cells are identical in every way or at least very close. This is because in bacteria they have n o parent just a split, making the two cells almost like brothers instead of parent and child.\n\n"},"divergent":{"title":"divergent","links":["family-relationships","jojo-rabit-(movie)","the-sniper","war-is-damaging","genocide","factions"],"tags":["movie","divergent","6enf"],"content":"SKIP to important Themes at the end of the film\nintro to factions\nAfter picking their factions they do challenges to prove there belong to there correlating factions.\nin the case of the protagonist in the dauntless faction, she has to climb up to a train as the first part of the test. They then have to jump to a rooftop slong side the train line. You get the idea you have to do an arry of tasks to prove you have what it takes.\nTraning\nthey are told that there is a new rule that the lowest preforming puples of the class will become factionless. when she was put in a ring with a pure dauntless she had other quality of the other factions as she is a divergent meaning quality of a range of factions. Like empathy which stops her from putting in her all to defeat her opponent. at the tatto parla she see the person who tested her and knows shes a divergent see her agin gives her newly found confidence and trains harder than before. 4 the trainer starts to show a nicer side of his personality giving tips and showing he may be more than a dauntless war machine.\nWar games\nshe runs from the infermory to the train on the way to the war games 4’s first choice as a captain is the protagnest as he see she has other quaitys other than being a grunt like the full dauntles’s.\nshe shows one of these quaity in climbing to have a look out this shows her smarts. this allows her team to win the war game.\nParents divergent\nthis scene shows family relationships being broken or provoked as she is different compared to the others that are pure one faction. They fell intimidated of whom that can have many character defining traits.\nThe erudite trying to rule the government\nthe erudite are try to take place of the abnegation. As they have been trying and trying to dehumanise everyone and turn them against human nature so that they have a dependence on them. Becuse the way an evil can build control through dependence.\nPropaganda at work\nbecause of the fear caused by becoming factionless, this fear is induced by the dependence of the status to live a meaningful life according to the propaganda. When kids have this values instilled apon them from birth, these values often last life times as a kid cannot make their own disistions for them selfs.\n4 &amp; protagonist go for a trip\n4 and the protagonist go for a trip together. Shows the protagonist how to blend in to how a dauntless would do things to avoid being caught. Becuse she has the traits of other factions, she could easily be caught if they see she’s using these skills she shouldn’t have.\n4\n4 is a divergent just like the protagonist by learning the morals of each faction. He shows his back which has every faction on it, showing he wants to earn the traits of each.\nFinal test\nthe final test is important becuse she has to fight her fares fast and without susption of her being a divergent. her being sexualy abused was in that final test with the love interest of the protagnest. she also had to kill a meber of her family duing the scene\nThe serum\nthey all got injected with a transplant after that controls them so they have formed a mindless army. the protagonist has to try her best to blend in as the transplant didn’t work. she find 4 who is also just blending in as he is also now a divergent\ngeting caught\nthey get singled out, and they are tested buy a gun almost being shot at 4 head. they got caught by trris holding a gun to there heads ot them caught then the mum free them. they fight back as they are being chaced by meny mindless drones of humans. the mum dies as they cross a wide open road.\nControlling system\nthey have a control system inside the dauntless base. She sees 4 who has been taken over. She breaks the mind control by using love, just like a classic movie love tale. Furthermore, she then holds the leader of erudite, who is controlling everyone. They then made her shutdown the system now everyone is free again but the leaders of the dauntless have the same thoughts as the erudite.\nThemes at the end of the film\nfamily relationships\nfamily relationships are tested and people are lost. Both the dad and mum of Betris (protagonist) die while fighting for the betterment of the city. This is true of jojo rabit (movie) and the sniper where they all have an immediate family member die due to a conflict. In the text the sniper, it was a political civil war. These all have propaganda at their core to cause the conflict.\nwar is damaging\noThis film shows how war/conflicts can be damaging, hurting and often unnecessary homicide or mass genocide. This links into family relationships as this is the result of this damage. War causes families to turn on themselves or even kill each other, that’s in the case of the sniper he kills his brother unknowingly. Genocide applys quite well to the intent of the erudite the intelgens of the cosiety wanted to put themself in power. they had thought that the only way was to wipe out the law makers of the city causing a genocide.✍️\nTransclude of factions"},"factions":{"title":"factions","links":[],"tags":["6enf","movie","divergent"],"content":"candor\nhonest \n\ndauntless\nthe brave\n\nerudite\nintelgence\n\namity\nkind \n\nAbnegation\nselfless\n"},"index":{"title":"index","links":[],"tags":["6enf","6sce","bio","chem","dit","6dit","7phx","7enf","7dit","7che"],"content":"WOW I Am Sooooooo Good At School Check Out My 10/10 Cheat Codes !!!\nI like google"},"kuberneties":{"title":"kuberneties","links":[],"tags":["dit"],"content":"How I Use Kuberneties\nI use kuberneties mostly in my CD pipeline I also have deployed other servieces like bitwarden a password manager too.\nContinuous Deployment (CD)\nThe main service that makes continious deployment work for me is ArgoCd. ArgoCd reads and deploys my apps from the kuberneties manifest if you dont know are simular to docker compose files"},"pe-journal-format":{"title":"pe journal format","links":[],"tags":["6ped"],"content":"Structure\nWHAT: &lt; what factors applied &gt;\nHOW:  &lt; how did this affect you &gt;\nWHY: &lt; Why you think this had a impact &gt;\nNEXT TIME: &lt; What you would change for next time &gt;\nWhen has been used\nI used this two times during my 6ped course on the 1.1 and 1.5 assessments where we keep journals after each practical activity. i could see this format of jornals being usefull not only for futre assesments i would like to implemnt it into something i do on my own time."},"pi-Api/Add-To-Your-Project":{"title":"Add To Your Project","links":[],"tags":["piApi","dit"],"content":"Add This Module\n\nRun the following CLI commands\n\ngit submodules init\ngit submodules update --remote # updates the submoule with the \n\nCreate a .gitmodules file in the root\n\n[submodule &quot;piApi&quot;]\n\tpath = piApi\n\turl = github.com/Notliam99/piApi.git\n\tbranch = builds\nThe Project directory"},"pi-Api/Demo":{"title":"Demo","links":[],"tags":["github","piApi","dit"],"content":"Demo\nSimple demo script is included in the Github repository here: main.py\nmain.pyfrom piApi import Api\n \n \napi = Api()\n \n \n@api.get(&#039;/&#039;)\ndef hello_world(request):\n    &quot;&quot;&quot;\n        Index route decorated by @api.get()\n        ARGS:\n            request: dict # contains the parsed request\n        RETURNS:\n            document: str\n            responce_code: int # optional\n            custom_headers: dict # optional Requries( responce_code )\n    &quot;&quot;&quot;\n    doc = f&#039;&#039;&#039;\n        &lt;center&gt;\n            &lt;h1&gt;Hello World&lt;h1&gt;\n            &lt;hr&gt;\n            &lt;p&gt;{request}&lt;/p&gt;\n        &lt;/center&gt;\n    &#039;&#039;&#039;\n    return doc, 200\n \n \ndef Main():\n    api.run(80)\n \n \nif __name__ == &#039;__main__&#039;:\n    Main()"},"pi-Api/Module":{"title":"Module","links":[],"tags":["piApi","dit"],"content":"Add This Module\nUsing Git\nCreate\n[submodule &quot;piApi&quot;]\n\tpath = piApi\n\turl = github.com/Notliam99/piApi.git\n\tbranch = builds\nRun the following commands\ngit submodules init\ngit submodules update --remote # updates the submoule with the "},"pi-Api/Pi-Api":{"title":"Pi-Api","links":["pi-Api/Demo"],"tags":["github","piApi","dit"],"content":"Pi-API is a simple module made for micro Python.  to make simple web enabled projects use it to integrate with your own code.\nDemo\nMore Documentation To Be Done"},"semantic-html":{"title":"semantic html","links":["semantic-css","Html-tags"],"tags":["6dit","web","dit"],"content":"Semantic is a style to your html along with this your css will have to be formated in a way that makes in easy to work with this.\nHTML\nThe html uses some new Html tags that i havent seen before\n&lt;body&gt;\n\t&lt;header&gt;\n\t\t&lt;section&gt;\n\t\t\t&lt;head&gt;WEBSITE&lt;/head&gt;\n\t\t&lt;/section&gt;\n\t\t&lt;section&gt;\n\t\t\t&lt;nav&gt;\n\t\t\t\t...\n\t\t\t&lt;/nav&gt;\n\t\t&lt;/section&gt;\n\t&lt;/header&gt;\n\t&lt;main&gt;\n\t\t&lt;section&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t&lt;/section&gt;\n\t\t&lt;section&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t&lt;/section&gt;\n\t&lt;/main&gt;\n\t&lt;footer&gt;\n\t\t&lt;section&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t&lt;/section&gt;\n\t&lt;/footer&gt;\n&lt;/body&gt;\nWHY\nIts to organsise your you code into blocks kind of like object orentend programing pardimes in othe langwages but less readable. by coding in this way it allows you to work on one part at a time. just like in functions in other langwages where you can work on one part at a time."},"the-sniper":{"title":"the sniper","links":["family-relationships"],"tags":["6enf","movie"],"content":"Explain the general plot\none theme of this theme of this short storey is the pretrail of family relationships that are ruined with the protagnists brother.\nstory\nThe long June twilight faded into night. Dublin lay enveloped in darkness but for the dim light of the moon that shone through fleecy clouds, casting a pale light as of approaching dawn over the streets and the dark waters of the Liffey. Around the beleaguered Four Courts the heavy guns roared. Here and there through the city, machine guns and rifles broke the silence of the night, spasmodically, like dogs barking on lone farms. Republicans and Free Staters were waging civil war.\nOn a rooftop near O’Connell Bridge, a Republican sniper lay watching. Beside him lay his rifle and over his shoulders was slung a pair of field glasses. His face was the face of a student, thin and ascetic, but his eyes had the cold gleam of the fanatic. They were deep and thoughtful, the eyes of a man who is used to looking at death.\nHe was eating a sandwich hungrily. He had eaten nothing since morning. He had been too excited to eat. He finished the sandwich, and, taking a flask of whisky from his pocket, he took a short drought. Then he returned the flask to his pocket. He paused for a moment, considering whether he should risk a smoke. It was dangerous. The flash might be seen in the darkness, and there were enemies watching. He decided to take the risk.\nPlacing a cigarette between his lips, he struck a match, inhaled the smoke hurriedly and put out the light. Almost immediately, a bullet flattened itself against the parapet of the roof. The sniper took another whiff and put out the cigarette. Then he swore softly and crawled away to the left.\nCautiously he raised himself and peered over the parapet. There was a flash and a bullet whizzed over his head. He dropped immediately. He had seen the flash. It came from the opposite side of the street.\nHe rolled over the roof to a chimney stack in the rear, and slowly drew himself up behind it, until his eyes were level with the top of the parapet. There was nothing to be seen—just the dim outline of the opposite housetop against the blue sky. His enemy was under cover.\nJust then an armored car came across the bridge and advanced slowly up the street. It stopped on the opposite side of the street, fifty yards ahead. The sniper could hear the dull panting of the motor. His heart beat faster. It was an enemy car. He wanted to fire, but he knew it was useless. His bullets would never pierce the steel that covered the gray monster.\nThen round the corner of a side street came an old woman, her head covered by a tattered shawl. She began to talk to the man in the turret of the car. She was pointing to the roof where the sniper lay. An informer.\nThe turret opened. A man’s head and shoulders appeared, looking toward the sniper. The sniper raised his rifle and fired. The head fell heavily on the turret wall. The woman darted toward the side street. The sniper fired again. The woman whirled round and fell with a shriek into the gutter.\nSuddenly from the opposite roof a shot rang out and the sniper dropped his rifle with a curse. The rifle clattered to the roof. The sniper thought the noise would wake the dead. He stooped to pick the rifle up. He couldn’t lift it. His forearm was dead. “I’m hit,” he muttered.\nDropping flat onto the roof, he crawled back to the parapet. With his left hand he felt the injured right forearm. The blood was oozing through the sleeve of his coat. There was no pain—just a deadened sensation, as if the arm had been cut off.\nQuickly he drew his knife from his pocket, opened it on the breastwork of the parapet, and ripped open the sleeve. There was a small hole where the bullet had entered. On the other side there was no hole. The bullet had lodged in the bone. It must have fractured it. He bent the arm below the wound. The arm bent back easily. He ground his teeth to overcome the pain.\nThen taking out his field dressing, he ripped open the packet with his knife. He broke the neck of the iodine bottle and let the bitter fluid drip into the wound. A paroxysm of pain swept through him. He placed the cotton wadding over the wound and wrapped the dressing over it. He tied the ends with his teeth.\nThen he lay still against the parapet, and, closing his eyes, he made an effort of will to overcome the pain.\nIn the street beneath all was still. The armored car had retired speedily over the bridge, with the machine gunner’s head hanging lifeless over the turret. The woman’s corpse lay still in the gutter.\nThe sniper lay still for a long time nursing his wounded arm and planning escape. Morning must not find him wounded on the roof. The enemy on the opposite roof covered his escape. He must kill that enemy and he could not use his rifle. He had only a revolver to do it. Then he thought of a plan.\nTaking off his cap, he placed it over the muzzle of his rifle. Then he pushed the rifle slowly upward over the parapet, until the cap was visible from the opposite side of the street. Almost immediately there was a report, and a bullet pierced the center of the cap. The sniper slanted the rifle forward. The cap clipped down into the street. Then catching the rifle in the middle, the sniper dropped his left hand over the roof and let it hang, lifelessly. After a few moments he let the rifle drop to the street. Then he sank to the roof, dragging his hand with him.\nCrawling quickly to his feet, he peered up at the corner of the roof. His ruse had succeeded. The other sniper, seeing the cap and rifle fall, thought that he had killed his man. He was now standing before a row of chimney pots, looking across, with his head clearly silhouetted against the western sky.\nThe Republican sniper smiled and lifted his revolver above the edge of the parapet. The distance was about fifty yards—a hard shot in the dim light, and his right arm was paining him like a thousand devils. He took a steady aim. His hand trembled with eagerness. Pressing his lips together, he took a deep breath through his nostrils and fired. He was almost deafened with the report and his arm shook with the recoil.\nThen when the smoke cleared, he peered across and uttered a cry of joy. His enemy had been hit. He was reeling over the parapet in his death agony. He struggled to keep his feet, but he was slowly falling forward as if in a dream. The rifle fell from his grasp, hit the parapet, fell over, bounded off the pole of a barber’s shop beneath and then clattered on the pavement.\nThen the dying man on the roof crumpled up and fell forward. The body turned over and over in space and hit the ground with a dull thud. Then it lay still.\nThe sniper looked at his enemy falling and he shuddered. The lust of battle died in him. He became bitten by remorse. The sweat stood out in beads on his forehead. Weakened by his wound and the long summer day of fasting and watching on the roof, he revolted from the sight of the shattered mass of his dead enemy. His teeth chattered, he began to gibber to himself, cursing the war, cursing himself, cursing everybody.\nHe looked at the smoking revolver in his hand, and with an oath he hurled it to the roof at his feet. The revolver went off with a concussion and the bullet whizzed past the sniper’s head. He was frightened back to his senses by the shock. His nerves steadied. The cloud of fear scattered from his mind and he laughed.\nTaking the whiskey flask from his pocket, he emptied it a drought. He felt reckless under the influence of the spirit. He decided to leave the roof now and look for his company commander, to report. Everywhere around was quiet. There was not much danger in going through the streets. He picked up his revolver and put it in his pocket. Then he crawled down through the skylight to the house underneath.\nWhen the sniper reached the laneway on the street level, he felt a sudden curiosity as to the identity of the enemy sniper whom he had killed. He decided that he was a good shot, whoever he was. He wondered did he know him. Perhaps he had been in his own company before the split in the army. He decided to risk going over to have a look at him. He peered around the corner into O’Connell Street. In the upper part of the street there was heavy firing, but around here all was quiet.\nThe sniper darted across the street. A machine gun tore up the ground around him with a hail of bullets, but he escaped. He threw himself face downward beside the corpse. The machine gun stopped.\nThen the sniper turned over the dead body and looked into his brother’s face."}}