{"2024-python-refresh":{"title":"2024 python refresh","links":["tags/7dit"],"tags":["7dit","dit"],"content":"Outline For The “short Script”\nMine is Not Short at all but it cover the rest of the requirements of the other challenges. For those who Know its the first question in the python refresher for7dit . The brief “Write a program that asks the user to input a number. Then, print your full name that number of times.”\nCode\nmain.pydef input_and_check(prompt: str, expected_type: type, none_able=False) -&gt; any:\n    possible_types: list = [int, float, str]\n \n    try:\n        input_val: str = input(prompt)\n \n        for i in possible_types:\n            if i is expected_type:\n                return i(input_val)\n \n        if none_able or (type(input_val) is None) or (input_val == &quot;&quot;):\n            raise ValueError(&quot;Input Does Not Match The Expected Type!&quot;)\n        else:\n            raise ValueError(&quot;Input Is Empty When Not Alowed&quot;)\n    except ValueError as error_code:\n        return error_code\n \n \ndef main() -&gt; None:\n\twhile True:\n        try:\n            name\n        except NameError:\n            name = input_and_check(\n                prompt=&quot;whats Your Name? &gt; &quot;,\n                expected_type=str,\n                none_able=False\n            )\n            if type(name) is ValueError:\n                del name\n                pass\n        try:\n            number_loops\n        except NameError:\n            number_loops = input_and_check(\n                prompt=&quot;think of a number 1 or higher &gt; &quot;,\n                expected_type=int,\n                none_able=False\n            )\n            if (type(number_loops) is ValueError):\n                del number_loops\n                pass\n            elif (number_loops &lt; 1):\n                print(f&quot;{name} You have to input a number higher&quot;)\n                del number_loops\n                pass\n        break\n \n    for i in range(number_loops):\n        print(f&quot;Hello {name}&quot;)\n \n \nif __name__ == &quot;__main__&quot;:\n    main()"},"6sce-mock":{"title":"6sce mock","links":[],"tags":["6sce"],"content":"Q1\na) correct\na = \\frac {\\Delta v} {\\Delta t}\na=\\frac{60^{ms}}{30_{s}}\na=2^{ms-2}\nb) correct\nScore: E1\nc)\ni) correct\nScore: A2\nii) correct\n\\begin{align}\nF_w &amp;= mg\\\\\n&amp; =770kg\\times10kg^{-1}\\\\\n&amp; =7700N\n\n\\end{align}\nScore: A3\niii) wrong\nquestion 2\nc)\nthe car was lifted 150 cm over a period of 30 seconds. Calculate the power output of the crane used to pull the car up\n\\begin{align}\nF &amp;= mg\\\\\n&amp;= 1500\\times10Nkg^{-1}\\\\\n&amp;=15000N\n\\end{align}\n\n\\begin{align}\nW &amp;= F d\\\\\n&amp;= 15000N\\times 1.5m\\\\\n&amp;= 22500J\n\\end{align}\n\n\\begin{align}\nP &amp;= \\frac W t\\\\\n&amp;= \\frac {22500J} {30s}\\\\\n&amp;=750W\n\\end{align}\n"},"7CHE/Practice-Report-2":{"title":"Practice Report 2","links":[],"tags":["7che"],"content":"Mystery cat-ion solution was mixed with NaOH a white precipitate was formed. Then, as an excess of NaOH was added, and perpetrate remained. This confirms the presence of Magnesium (Mg^{2+}). The formula that supports this OH^-_{(aq)} + Mg^{2+}_{(aq)} \\rightarrow MgOH_{(s)} this is proven by the solubility rule “Hydroxides are insoluble except; Alkali metal hydroxides are soluble. [Ba^{2+}, Sr^{2+}, Ca^{2+}, Tl^+] are considered slightly soluble”. Now that we have identified Mg^{2+} what are the effects on humans."},"7CHE/Practice-report":{"title":"Practice report","links":[],"tags":["7che","chem"],"content":"Testing Cations [Cu^{2+},Fe^{2+},Fe^{3+},Ag^{+},Pb^{2+},Mg^{2+},Ba^{2+},Al^{3+},Zn^{2+},Na^{+}]cd\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTestObservationsions eliminatedNames and/or formula of preciptates that form.equations for formation of precipitatesAdd NaOHOrange PreciptateCu^{2+},Fe^{2+}...Iron(III) HydroxideFe^{3+}+OH\\rightarrow Fe(OH)_3Add KSCNBlood red PreciptateFe^{2+}...Iron(III) thiocyanateFe^{3+}+SCN^-\\rightarrow [FeSCN]^{2+}\nWe added a NaOH solution to the mystery solution, a Orange precipitate formed as NaOH was added. This shows me that the solution is most likely Fe^{3+} because of the color of the precipitate. Formula for this reaction was (Fe^{3+}+OH\\rightarrow Fe(OH)_3). Next, we added a KSCN to a fresh sample of the mystery solution; When it was added, a blood-red precipitate formed. We saw a blood red precipitate this proves that this compound is Fe^{3+}. The formula used to reach this conclusion was (Fe^{3+}+SCN^-\\rightarrow [FeSCN]^{2+})."},"7CHE/Redox-practice-assesment":{"title":"Redox practice assesment","links":[],"tags":["7che"],"content":"1st question\nFe^{2+}, SO_4^{2-} and Cl_2 to Fe^{3+}\nFe^{2+} \\rightarrow Fe^{3+} + 1e^-\nCl_2 + 2e^{-} \\rightarrow 2Cl^-\n2Fe^{2+} + Cl_{2} \\rightarrow 2Fe^{3+} + 2Cl^{-}\n2nd question\nPo(MnO_{4})_3 purple and FeSO_{4} pale green to Fe^{3+} orange\nFe^{2+}\\rightarrow Fe^{3+} + 1e^{-}\nMnO_{4}^{-} + 8H^{+} + 5e^- \\rightarrow Mn^{2+} + 4H_{2}O\n5Fe^{2+} + MnO_{4}^{-} + 8H^{+} \\rightarrow 5Fe^{3+} +Mn^{2+} + 4H_2O"},"7CHE/Redox":{"title":"Redox","links":[],"tags":["7che"],"content":"\nOxidation\n\\begin{align}\nMnO^-_{4\\space(purple)} +8H^+ + 5e^- &amp;\\rightarrow Mn^{2+}_{(colourless)} + 4H_20\n\\end{align}\n\nReduction\n\n\\begin{align}\nFe^{2+} \\space (pale \\space greeen) &amp;\\rightarrow Fe^{3+} \\space (orange \\space brown) + e-\n\\end{align}\n\n???\n\nMn^{+7}O_4^{-2} \\rightarrow \nSteps to Do it right\n\nidentify the species\nlabel the colours\nhalf equations\n\nblance the atoms\nbalance O\nbalance H\nadd e-\n\n\nsentence for justification\n\nOxidation\nIs\nLoss\nElectrons,\nReduction\nIs\nGain\nElectrons\nK_2Cr_2O_7 and FeSO_4\n1.\nCr_{2}O _{7}^{\\space 2-} + 14H^{+} +6e^-&amp;\\rightarrow 2Cr^{3+} + 7H_{2}\\\\\nCr^{6+}+O^{+2} + H^{+} &amp;\\rightarrow ... TBD\\\\\nOrange &amp;\\rightarrow  Green\n\\end{align}\n\n\n\n\\begin{align}\nFe^{2+} &amp;\\rightarrow Fe^{3+} + e-\\\\\ngreen &amp;\\rightarrow orange/brown\n\\end{align}$$\n# practice question \n### 3.\n\n&gt; [!question] question\n&gt; \n&gt; A pale green solution of iron (II) sulfate is mixed with some dilute sulfuric acid and then a pale green solution of chlorine is added dropwise forming an orange / brown solution.\n\n\\begin{align}\nFe^{+2} &amp;\\rightarrow Fe^{+3}+e-\\\n\\\nGreen &amp;\\rightarrow Orange/Brown\n\\end{align}\n==^^^ Loss of electrons this means its undergoes oxidization. ^^^==\n\\begin{align}\nCl_{2}+2e^{-} &amp;\\rightarrow 2Cl^{-}\\\n\\\nPale Green &amp;\\rightarrow Colourless\n\\end{align}\n==^^^ Gain of electrons this shows that it is reduction. ^^^==\n\n==Full equation==\n\\begin{align}\n2Fe^{2+}+Cl_{2} &amp;\\rightarrow 2Fe^{3+} + 2Cl^-\n\\end{align}\n### 10.\n\n&gt; [!question] Question\n&gt; \n&gt;  An orange solution of potassium dichromate mixed with dilute hydrochloric acid is added to a colourless solution of sodium sulfite. The solution turns green.\n\n$$Cr_2O_7^{\\space2-} + 14H^{+} + 6e^-\\rightarrow 2Cr^{3+} + 7H_{2}O$$\n$$SO_3^{\\space2-} + H_2O \\rightarrow SO_{4} + H^{+} + 2e^-$$\n\n$$3SO_3^{\\space2-} + H_{2}O + Cr_2O_{7}^{\\space2-} +14H^{+}\\rightarrow SO_4^{\\space2-}$$"},"7CHE/Shapes--and--Angles-Of-CCl_2F--and--SO_2":{"title":"Shapes & Angles Of CCl_2F & SO_2","links":[],"tags":["7che"],"content":"\nC Cl_{3}F\nThis has 4 areas of electron dencity. All are bondened therfore forms a tetrahedral shape. All areas of electron dencity … to be finnished\n"},"7CHE/moles-qalitative":{"title":"moles qalitative","links":[],"tags":["7che"],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKnown Na_{2}CO_{3}Unknown HCl0.05 \\frac{mol}{L}c 0.1015 \\frac{mol}{L}20.3mlv20\\times 10^{-3}L 0.001015n0.00203 or 2.03\\times 10^{-3}Ratio 1:2\nKnown Na_{2}CO_{3}\nNumber Of moles\n\\begin{align}\nn&amp;=cv\\\\\nn&amp;=0.05 \\frac{mol}{L}\\times(20.3\\times10^{-3})L \\\\\nn&amp;= 0.001015\n\\end{align}\nUnknown HCl\nConcentration\n\\begin{align}\nc&amp;=\\frac{n}{v}\\\\ \\\\\nc&amp;=\\frac{0.00203}{(20\\times 10^{-3})L} \\\\\nc&amp;=0.1015 \\frac{mol}{L}\n\\end{align}"},"7DIT/7DIT-Major-Project-Portfolio/Final-Project":{"title":"Final Project","links":[],"tags":["7dit","dit"],"content":"\n\n                  \n                  Important\n                  \n                \nAuthenticity DeclarationI confirm that, for this project: All of the work submitted is my own, with the possible exception of publicly available code snippets which have been appropriately referenced I understand that I may be asked to explain aspects of my project, and a reasonable level of understanding must be evident to meet the requirements of the Achievement Standard\n\nFinal release on Github\nEmbed your link here\nFinal Commentary\n\n\n                  \n                  Important\n                  \n                \nWrite a summary of your project overall. For Excellence, this must include an extensive discussion about how the information from planning, testing and trialling of components assisted in the development of a high-quality outcome\n"},"7DIT/7DIT-Major-Project-Portfolio/Formal-Project-Proposal":{"title":"Formal Project Proposal","links":[],"tags":["7dit","dit"],"content":"\n\n                  \n                  Important\n                  \n                \nStudent / Group Name:  L2Dit\n\n\n\n                  \n                  Important\n                  \n                \nProject Title:  Notes R us\n\nNominated Assessments (remove two)\n\n2.8 - Processes (6 credits)\n2.3 - Databases (4 credits)\n\nProject Description &amp; Purpose\nOnline Blogging platform first goal of holding blog/note information in a database accessible through a API. To enable the sharing of these through share links. A final goal of a full Stack app more than just a API having a fleshed out user experience/user interface.\nProblem, issue, interest or opportunity that is being addressed\nThe Current way of sharing notes in school especially in science classes. where google sites are widely used in the department for note taking and sharing. Google sites has a old user interface using a proprietary standards standards. With our application well use open standards like markdown that can be edited by a large array of applications.\nEnd Users\nAn example end user would be a student. A student could make a Homework document then upload it and get it check by a teacher. I use a similar service Quartz a static site generator for markdown notes. That i use for school like one of our targret end user would use it as.\nKey Resources\nServer resources for hosting the API application. That facilitates the Upload and the management of these documents e.g. the viewing, archiving or deleting of notes. A front end client that interfaces with the documents through the API to preform actions mentioned above.\nKey Project Components\nAPI server using poem and poem-openapi less established but stable with auto API documentation using the OpenApi standard . API client using either leptos a rust front end framework with a well establish surrounding ecosystem. Plus using tailwind for styling for components. For a data base well run Postgres database a well established database in the industry.\nMy Responsibilities\nManage the Git Repository checking best practices along with the rest of the team. Data base development and infrastructure. Primary infrastructure/DevOps engineer. Plus integration into the API.\nMinimum Viable Product (MVP) Specs\nA asynchronous API built in rust to Upload, delete and request the documents stored in a database. On top of this well build a simple user interface to facilitate these actions.\n\n Teacher has checked and approved this project proposal\n\nDate: 15/5/24"},"7DIT/7DIT-Major-Project-Portfolio/Project-Overview":{"title":"Project Overview","links":["Github-Guide","7DIT/7DIT-Major-Project-Portfolio/Assessment-Information","Handing-in-your-project"],"tags":["7dit","dit"],"content":"Summary\n\nEach student (or small group) will select a unique project that results in a digital technologies outcome\nEvery project must be approved by the teacher before starting. A formal project proposal document must be submitted\nThe project will be assessed using AS91897 - Use advanced processes to develop a digital technologies outcome\nThis project will be handed in at the end of Week 5, Term 3. The exact time and date will be communicated closer to the time, and is subject to change.\n\nAssessment Details\nYou will be assessed on\n\nhow effectively you use project management tools and techniques to plan and manage the development of a digital outcome\nhow effectively you decompose the problem into smaller components, and test and refine your digital outcome so that it is a high-quality project\nhow well you have addressed relevant implications\nhow well you synthesise information from the planning, testing and trialling of components to develop a high-quality outcome\n\nProject Selection\nIn consultation with your teacher, you will identify a suitable digital technologies project to work on. You have significant choice in what your project will be, and this is a deliberate decision to allow you to explore an area of interest. Throughout the project, you must make use of advanced processes as outlined in AS91897 - Use advanced processes to develop a digital technologies outcome. This includes the use of project management tools and techniques which are outlined below.\nProject management tools and techniques\nExamples include:\n\nsaving backup copies with a logical file naming system\nusing collaboration tools\nusing simple version control software applications\nusing tools or systems to plan tasks and milestones\nadjusting key actions and tasks where appropriate\n\nA guide that outlines how to use Github to support this project is available here:\nGithub Guide\nDocumenting Your Project\nAs you work through your project, it is important to document your progress. The examples below assume use of a project board implemented using Github and supported by your work in this Notion portfolio.\n\n\n                  \n                  Important\n                  \n                \nNote: If working as part of a small team, each person must develop their own documentation. This must clearly show the work that has been done by each team member, and how individuals have applied project management tools and techniques.\n\nNotion Portfolio Documentation\nThree separate Sprint pages have been created for you and linked from the portfolio dashboard. These pages contain a number of sections for you to fill in as you work. You are encouraged to modify these pages to suit your project if necessary.\n\n\nSprint Planning: What you are aiming to achieve in the next sprint\n\n\nDay to day development log: Ongoing notes regarding project development, trialling and testing\n\n\nSprint Retrospective: Share your latest release and gather feedback\n\n\nSprint Review: Review your progress from the last sprint, and use this to inform planning for next sprint\n\n\nFinal release\n\nA separate Notion page has been set up for your final release notes and documentation. This should include a discussion of how information gained from planning, testing and trialling project components has led to the development of a high quality digital technologies outcome.\n\nGithub Repo / Project Documentation\n\n\nYour Github repository will contain your project files along with evidence of your ongoing code commits. Formal releases will be completed at the end of each sprint.\n\n\nYour Github project board will be used to plan and track each sprint. You should take screenshots of your project board at various stages throughout your project. This will help to demonstrate how you have implemented relevant project management techniques.\n\n\nAdditional Assessment\nDepending on the nature and content of your project, it may be possible to meet the requirements of additional Achievement Standards. Your focus should be on developing a really interesting and meaningful project. Additional assessments should be considered a bonus. Possible additional assessments include:\n\n\nAS91892 - 2.3 Use advanced techniques to develop a database\n\n\nAS91893 - 2.4 Use advanced techniques to develop a digital media outcome\n\n\n\n\n                  \n                  Important\n                  \n                \nFor further information regarding how this project will be assessed, Assessment Information\n\n\n\n                  \n                  Important\n                  \n                \nFor instructions regarding how to submit your project, Handing in your project\n"},"7DIT/7DIT-Major-Project-Portfolio/Sprint-1---7th-June":{"title":"Sprint 1 - 7th June","links":["kubernetes"],"tags":["7dit","dit","dit-28","dit-23"],"content":"Sprint Planning\n\n\n                  \n                  Important\n                  \n                \nAt the start of each sprint, look through your backlog and decide which tasks you will aim to complete during this sprint. Add these tasks to the relevant sprint, and add labels indicating which relevant implications each task addresses\n\nProject Board Screenshot (Start of sprint)\n20/4/2024\n\nCommentary (including brief outline of how relevant implications will be addressed)\nDevelopment Log\n\n\n                  \n                  Important\n                  \n                \nAs you work on your project, take note of key trialling and testing in this section\n\n2024-05-20 Infrastructure layout of the database and app\nI have decided on a database for the application. I have decided against the use of sled sue to the complexity involved in creating a high availability deployment of it. this is due to inherit flaws of file systems; you would have overwrites and file conflicts if you had a high flow of traffic asynchronously writing to the same file system.\nWhat Is The Savor\nCloud Native PG a cloud native PostgreSQL database. It Drastically simplify the deployment of PostgreSQL on kubernetes it also implements many standards found in normal PostgreSQL clusters. I does this by being a custom kubernetes controller written in my teachers current favorite language Go-lang. It allows easy dashboard logging using Prometheus and grafana.\nApplication Layout\n\nDatabase Monitoring potentialy latter sprint...\n\n2024-05-21  Docker Builds Git Hub Actions\ngithub.com/l2dit/NotesRUs/issues/15\ni keept braking curently theres a fix waiting to be pushed into master\n2024-05-23 PostgreSQL works !!!\nI had to install a nfs provisioner it creates sub-directory’s for volumes to be stored in on my nfs server dynamically.  This means i don’t have to manually create volumes for each Pod/Container by hand. I used this GUIDE/PLUGIN this also means that i can setup dynamic ramp up and ramp down too.\nkubernetes/1-cnpg.yamlapiVersion: postgresql.cnpg.io/v1\nkind: Cluster\nmetadata:\n  name: postgresql-pvc-template\nspec:\n  instances: 3\n \n  storage:\n    storageClass: nfs-client\n    size: 1Gi\nIt makes the database just a single file simplification at least for this app not the extra dependency.\n2024-05-25 Small CI update\nmade so it builds for multiple architectures.\npush_master.yamlname: On Push To Master\n \n# ... Actual changes not hole file\n  - name: Setup QEMU\n\tuses: docker/setup-qemu-action@v3\n\t\n  - name: Docker Build &amp; Push\n\tuses: docker/build-push-action@v5\n\twith:\n\t  context: .\n\t  platforms: linux/386,linux/amd64,linux/arm/v7,linux/arm64,linux/ppc64le,linux/s390x\n\t  push: true\n\t  tags: |\n\t\tasskit/notesrus:${{ github.sha }}\n\t\tasskit/notesrus:latest\n\t\tghcr.io/${{ env.REPO }}:${{ github.sha }}\n\t\tghcr.io/${{ env.REPO }}:latest\n\t  file: ./Dockerfile \n2024-05-25 Kubernetes Is Done\nArchitecture change…\n\nI have added Pg Bouncer this is responsible for rate limiting and other security features.\nManifests\nManifests are complete if you want a high level of whats happening look HERE. I have exposed the necessary environment variables to the container for a data base connection.\nEnviroment Vars# Application Enviroment Vars\nPORT=&quot;3000&quot;\nORIGNS=&quot;0.0.0.0&quot;\nKUBERNETES=&quot;true&quot;\n \n# PostgreSQL Enviroment Vars\nPOSTGRESQL_USERNAME=&lt;username_secret&gt;\nPOSTGRESQL_PASSWORD=&lt;password_secret&gt;\nPOSGRESQL_IP=&lt;postgresql_ip_address&gt;\nPOSGRESQL_IP=&lt;posgresql_port&gt;\n28/5/24 Update Enviroment Vars And Implement\nchanged the env vars all done in the kubernetes branch\n29/5/24 docker Builds\nWorking on simplifying the docker builds as its taking too much action time.\n30/5/24 Docker Builds\nHave changed the compile of each step to be done on bare metal this time should improve performance quite a lot.\n3/6/24 CI Head aches\nThe Last Couple days of delve time have been spent on fix and patching continuous integration. as were coming up to MVP they call it ingratiation nightmare. but i have done it also integrating branches of code together. its now deployed to notesrus.nzdev.org/ using memory as storage. This is because there was not enough time to get to the integration of the PostgreSQL data base. Adding the database is at the top of my list for the next sprint.\nTesting Feedback\n\n\n                  \n                  4/6/24 \n                  \n                \nEarly Test Feedback\nWe have given some people the domain it does work but it has been described a clunky. We do not have a editor so it takes either a third party editor or previous knowledge of the markdown standard. This a feature we hope to work on during the next sprint.\nDemographic\nThe demographic were mostly people well versed in using a computer as they were students, but had no experience with the markdown standard.\n\n\n\n                  \n                  5/6/24 \n                  \n                \nTesting Day\nWe had our testing day. Where we showcased our product to the rest of the class.\nUser Demographic\nThe demographic were mostly people well versed in using a computer as they were students, but had no experience with the markdown standard.\nFeedback and Quotes\nThat The system is not outlined enough to make it easier to use.\n\nSprint Review\n\n\n                  \n                  Important\n                  \n                \nSummarise key feedback from user testing, and highlight areas of focus for next sprint\n\nFor next sprint we have already discussed ideas of what we want to include in this next push. There is almost too much stuff. Number one for me at least is implementing PostgreSQL into the API. Lot of time i’ll have to set aside to schema design. I’ll also need to setup basic authentication and profanity detection.\nSprint Retrospective\n\n\n                  \n                  Important\n                  \n                \nReflect on your progress throughout this sprint. Identify what went well, and what could be changed for the next sprint\n\nIn thinking back on the last 4 weeks of work our team organisation could have been a bit better. especial when it comes to communicating when developer work is being done. Going forward were probably going to have to do a stand up meeting at least once a week. To catch up on current progress and priority’s and sort our developer load.\nRelevant Implications Discussion (IMPORTANT)\nI only touched on the functionality side of recent implications. I only had chance to work on the deployment of the application. I focused on the docker action, docker file and learning/creating the kubernetes manifests.\nCommentary\nInfo\n\nLink to release on Git Hub: github.com/l2dit/NotesRUs/releases/tag/v0.1.0\nProject Board (End of sprint): github.com/orgs/l2dit/projects/4\n"},"7DIT/7DIT-Major-Project-Portfolio/Sprint-2---10th-July":{"title":"Sprint 2 - 10th July","links":[],"tags":["7dit","dit"],"content":"Sprint Planning\n\n\n                  \n                  Important\n                  \n                \nAt the start of each sprint, look through your backlog and decide which tasks you will aim to complete during this sprint. Add these tasks to the relevant sprint, and add labels indicating which relevant implications each task addresses\n\nWe Have a sprint of fleshing out ahead. We have had a lot of feedback for the previous sprint. the rest of my teams focus will be on the user facing interface of the project. my job will be to implement the data base and improve the Ci. The database will be more than it sounds. i have to plan/design it and connect to it in a fashion that multiple clients can write simultaneously. the application it self will retain its state full function. When connected to the database it will become stateless sorting the state in the database.\nProject Board Screenshot (Start of sprint)\n\nCommentary (including brief outline of how relevant implications will be addressed)\nDevelopment Log\n2024-06-16 Data Base Design\ndbdocs.io/21ltietjens/Notes-R-Us\n\n2024-06-18 Start Work On API\nTesting Feedback\n\n\n                  \n                  Testing \n                  \n                \nUser Demographic\nFeedback and Quotes\nDate\n\nSprint Review\n\n\n                  \n                  Important\n                  \n                \nSummarise key feedback from user testing, and highlight areas of focus for next sprint\n\nSprint Retrospective\n\n\n                  \n                  Important\n                  \n                \nReflect on your progress throughout this sprint. Identify what went well, and what could be changed for the next sprint\n\nInfo/Links\n\nLink to release on GitHub:\nProject Board (End of sprint):\n\nRelevant Implications Discussion (IMPORTANT)\nCommentary"},"7DIT/7DIT-Major-Project-Portfolio/index":{"title":"7DIT Major Project Portfolio","links":["7DIT/7DIT-Major-Project-Portfolio/Formal-Project-Proposal","7DIT/7DIT-Major-Project-Portfolio/Sprint-1---7th-June","7DIT/7DIT-Major-Project-Portfolio/Sprint-2---10th-July","7DIT/7DIT-Major-Project-Portfolio/Sprint-3---22nd-August","7DIT/7DIT-Major-Project-Portfolio/Final-Project","7DIT/7DIT-Major-Project-Portfolio/2.3-Database---Assessment-Criteria-Checklist","7DIT/7DIT-Major-Project-Portfolio/2.4-Digital-Media-Outcome---Assessment-Criteria-Checklist","Efficient-Tools-and-Techniques-(2.4-Excellence-Criteria)","7DIT/7DIT-Major-Project-Portfolio/2.7-Programming-Re-assessment---Assessment-Criteria-Checklist","Testing-Plan","7DIT/7DIT-Major-Project-Portfolio/Project-Overview","Github-Guide","7DIT/7DIT-Major-Project-Portfolio/Assessment-Information","Handing-in-your-project"],"tags":["7dit","dit"],"content":"\n\n                  \n                  Important\n                  \n                \nStudent Name:  Liam Tietjens\n\n\n\n                  \n                  Important\n                  \n                \nProject Title:  Notes R Us\n\n\n\n                  \n                  Important\n                  \n                \nProject Description:  Online Blogging platform\n\nFormal Project Proposal\n🔗 Portfolio Links\n\n🗃 Github Repo\n\n💼 Github Project\n\n👷‍♀️ Github Project Page\n🏃‍♂️ Sprint Documentation\n\nSprint 1 - 7th June\nSprint 2 - 10th July\nSprint 3 - 22nd August\nFinal Project\n📄 Additional Documentation (dependent on 2nd assessment)\n\n2.3 Database - Assessment Criteria Checklist\n2.4 Digital Media Outcome - Assessment Criteria Checklist\nEfficient Tools and Techniques (2.4 Excellence Criteria)\n2.7 Programming Re-assessment - Assessment Criteria Checklist\nTesting Plan\n📑 Reference Pages\n\nProject Overview\nGithub Guide\nAssessment Information\nHanding in your project"},"7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-1":{"title":"DailyLog 1","links":[],"tags":["7dit","dit"],"content":"What Have I Done\n\nI set up this documentation\nI created the GitHub repo\nInit the rust project\nfinaly I have made a item struct for containing all items on the menu\n\nItem Struct\nMy Awesome Structuse core::fmt;\nuse std::fmt::Display;\n \npub struct Items {\n    pub food: Vec&lt;String&gt;,\n    pub drinks: Vec&lt;String&gt;,\n    pub sides: Vec&lt;String&gt;,\n}\n \nimpl Items {\n    /// # New instance function\n    /// @prams: None\n    /// @return: instance of type\n    pub fn new(food: Vec&lt;String&gt;, drinks: Vec&lt;String&gt;, sides: Vec&lt;String&gt;) -&gt; Self {\n        Self {\n            food,\n            drinks,\n            sides,\n        }\n    }\n}\n \nimpl Display for Items {\n    /// # Implementation of Display on Items type\n    /// Allows the type Items to be printed / displayed\n    fn fmt(&amp;self, f: &amp;mut fmt::Formatter) -&gt; fmt::Result {\n        let mut output: String = String::from(&quot;Item: (food: [&quot;);\n \n        if self.food.len() != 0usize {\n            for i in &amp;self.food {\n                output.push_str(format!(&quot;{}, &quot;, i.as_str()).as_str());\n            }\n            output.replace_range((output.len() - 2).., &quot;&quot;)\n        }\n        output.push_str(&quot;], drinks: [&quot;);\n \n        if self.drinks.len() != 0usize {\n            for i in &amp;self.drinks {\n                output.push_str(format!(&quot;{}, &quot;, i.as_str()).as_str())\n            }\n            output.replace_range((output.len() - 2).., &quot;&quot;)\n        }\n        output.push_str(&quot;], sides: [&quot;);\n \n        if self.drinks.len() != 0usize {\n            for i in &amp;self.sides {\n                output.push_str(format!(&quot;{}, &quot;, i.as_str()).as_str());\n            }\n            output.replace_range((output.len() - 2).., &quot;&quot;)\n        }\n        output.push_str(&quot;])&quot;);\n \n        write!(f, &quot;{output}&quot;)\n    }\n}\nI had to implement the Display for the struct for it to display anything when printed. was simple to do though."},"7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-2":{"title":"DailyLog 2","links":[],"tags":["7dit","dit"],"content":"What I Have Done\n\nAdded unit test to the functions made thus far.\n\nDoc Unit tests\n\n\n                  \n                  Testing dit_as_91896::menu::Items::new(food: Vec&lt;String&gt;, drinks: Vec&lt;String&gt;, sides: Vec&lt;String&gt;)\n                  \n                \nNew instance function\n@prams:\n\nfood: vector of food items\ndrinks: vector of drinks\nsides: vector of sides\n\n@return: instance of type Items\nPanics\nThe function panics if the second argument is zero.\nuse dit_as_91896::menu::Items;\n \nlet food: Vec\\&lt;String&gt; = vec![String::from(&quot;0&quot;)];\nlet drinks: Vec\\&lt;String&gt; = vec![String::from(&quot;1&quot;)];\nlet sides: Vec\\&lt;String&gt; = vec![String::from(&quot;2&quot;)];\n \nlet items: Items = Items::new(food.clone(), drinks.clone(), sides.clone());\n \nassert!(items.food == food);\nassert!(items.drinks == drinks );\nassert!(items.sides == sides);\n\n\n\n                  \n                  Testing/Docs std::fmt::Display for dit_as_91896::menu::Items\n                  \n                \nfmt function\nThis allows the struct/type to be printed to the console.\nTesting\nTesting Implementation of Display on the Items struct.\nuse dit_as_91896::menu::Items;                                                       \nlet items: Items = Items {                                                   \n  food: vec![String::from(&quot;0&quot;)],\n  drinks: vec![String::from(&quot;1&quot;)],\n  sides: vec![String::from(&quot;2&quot;)],\n};\nassert!(format!(&quot;{items}&quot;).as_str() == &quot;Item: (food: [0], drinks: [1], sides: [2])&quot;);\n"},"7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-3":{"title":"DailyLog 3","links":[],"tags":["7dit","dit"],"content":"Today\nToday I updated the menu items struct to use hash_maps to make it so that it holds both the name of the item and the price.\nFrom\npub struct Items {\n    pub food: Vec&lt;String&gt;,\n    pub drinks: Vec&lt;String&gt;,\n    pub sides: Vec&lt;String&gt;,\n}\nTo\npub struct Items {\n    pub food: HashMap&lt;String, f64&gt;,\n    pub drinks: HashMap&lt;String, f64&gt;,\n    pub sides: HashMap&lt;String, f64&gt;,\n}\nNow Used Like\nuse map_macro::hash_map;\n \nuse dit_as_91896::menu;\n \nfn main() {\n    let items: menu::Items = menu::Items {\n        food: hash_map! {\n            String::from(&quot;0&quot;) =&gt; 0.0,\n        },\n        drinks: hash_map! {\n            String::from(&quot;1&quot;) =&gt; 1.0,\n        },\n        sides: hash_map! {\n            String::from(&quot;2&quot;) =&gt; 2.0,\n        },\n    };\n    println!(&quot;{items}&quot;)\n\t/* Outputs:\n\t    food: {\n\t        0: costs $0.00\n\t    },\n\t    drinks: {\n\t        1: costs $1.00\n\t    },\n\t    sides: {\n\t        2: costs $2.00\n\t    },\n\t*/\n}\n```:"},"7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-4":{"title":"DailyLog 4","links":["7DIT/AS-91896-Coding-Project-2.7/Liams-Level-2-Python-Project"],"tags":["7dit","dit"],"content":"Yesterday\nI fixed up the Items struct, tidying up the code. I then made a Order struct to hold the order and add to the order. The order struck also implements display so it can be printed normally with cool formatting.\nToday\nI intend in get the user input started and add methods to the order struct to calculate the profits, gross sales.\nWhat i actually got done… I have refactored the formatting for how all structs are prints, both Order and Food structs. Also have made a struct to allow the easy printing of a vector array of Order struct objects. The start I have made on CLI is very Early and has no compensation for false inputs. Among all this, I found a FLAW.\nThe Flaw\nI have not accounted for, the face that people would like more than one of an item. I haven’t made a quantities counter. My remedy to this is since the program’s main purpose as I set out below is for a calculator to display profit and cost not quantities as an output, so I will be able to avoid this issue. Transclude of Liams-Level-2-Python-Project#project-description"},"7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-5":{"title":"DailyLog 5","links":["7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-4"],"tags":["7dit","dit"],"content":"Today\nIssue addressed\nI Addressed the issue mentioned here to allow for a quantity grater than one to be discerned on the order. I have done this by increasing the cost by the cost of another item. Therefore, if I need to find the quantity I can divide the order bill for the item by the cost of one item.\nAll Mighty Code Snippet\n/order/mod.rs -&gt; fn order_addpub fn order_add(&amp;mut self, item_name: String) -&gt; Result&lt;(), &amp;&#039;static str&gt; {\n        if self.menu_items.food.contains_key(&amp;item_name) {\n            // checks if item_name is in food\n \n            if self.order.food.contains_key(&amp;item_name) {\n                // checks if theres allredy one in order\n \n                let price: f64 = self.order.food.get(&amp;item_name).unwrap()\n                    + *self.menu_items.food.get(&amp;item_name.clone()).unwrap();\n \n                self.order.food.insert(item_name.clone(), price);\n                Ok(())\n            } else {\n                self.order.food.insert(\n                    item_name.clone(),\n                    *self.menu_items.food.get(&amp;item_name.clone()).unwrap(),\n                );\n                Ok(())\n            }\n        } else if self.menu_items.drinks.contains_key(&amp;item_name) {\n            // checks if item_name is in drinks\n \n            if self.order.drinks.contains_key(&amp;item_name) {\n                // checks if theres allredy one in order\n \n                let price: f64 = self.order.drinks.get(&amp;item_name).unwrap()\n                    + *self.menu_items.drinks.get(&amp;item_name.clone()).unwrap();\n \n                self.order.drinks.insert(item_name.clone(), price);\n                Ok(())\n            } else {\n                self.order.drinks.insert(\n                    item_name.clone(),\n                    *self.menu_items.drinks.get(&amp;item_name.clone()).unwrap(),\n                );\n                Ok(())\n            }\n        } else if self.menu_items.sides.contains_key(&amp;item_name) {\n            // checks if item_name is in sides\n \n            if self.order.sides.contains_key(&amp;item_name) {\n                // checks if theres allredy one in order\n \n                let price: f64 = self.order.sides.get(&amp;item_name).unwrap()\n                    + *self.menu_items.sides.get(&amp;item_name.clone()).unwrap();\n \n                self.order.sides.insert(item_name.clone(), price);\n                Ok(())\n            } else {\n                self.order.sides.insert(\n                    item_name.clone(),\n                    *self.menu_items.sides.get(&amp;item_name.clone()).unwrap(),\n                );\n                Ok(())\n            }\n        } else {\n            Err(&quot;Error: The Item Could Not Be Found On The Menu.&quot;)\n        }\n    }\nCLI\nI have made some changes to the CLI that makes it far more error tolerant. This example even removes the risk of adding to many spaces (”  wow    wow ” → “wow wow”). if the function ran throws a error it simply tells the user and loops on giving them another go.\nSnippet\nSnippet/exampleloop {\n\tprint!(&quot;\\nAdd To Order: &quot;);\n    stdout().flush().unwrap();\n    let add: String = read!(&quot;{}\\n&quot;);\n \n    let add_vec: Vec&lt;&amp;str&gt; = add.trim().split_whitespace().collect();\n \n    let found: bool = match Do_somthing(add_vec.join(&quot; &quot;)) {\n        Ok(_) =&gt; false,\n        Err(_) =&gt; true,\n    };\n \n    if found {\n        println!(&quot;Did Not Reconise Item&quot;);\n        continue;\n    }\n}        \nCalculate profits\nTBD Docsting unit test and documentation...\nSnippet\n/order/mod.rs -&gt; pub fn cost_profit \npub fn cost_profit(&amp;self) -&gt; (f64, f64) {\n    let food_earnings: Vec&lt;f64&gt; = self.order.food.values().cloned().collect();\n    let sides_earnings: Vec&lt;f64&gt; = self.order.sides.values().cloned().collect();\n    let drinks_earnings: Vec&lt;f64&gt; = self.order.drinks.values().cloned().collect();\n \n    let cost_user: f64 = food_earnings.iter().sum::&lt;f64&gt;()\n        + drinks_earnings.iter().sum::&lt;f64&gt;()\n        + sides_earnings.iter().sum::&lt;f64&gt;();\n \n    let mut profit_store: f64 = 0.0;\n \n    for (key, value) in &amp;self.order.food {\n     let cost_item: f64 = *self.menu_items.food.get(key).unwrap();\n \n        let quantiy: f64 = value / cost_item;\n \n        profit_store += quantiy * (cost_item - *self.cost_for_items.food.get(key).unwrap());\n    }\n \n    for (key, value) in &amp;self.order.drinks {\n        let cost_item: f64 = *self.menu_items.drinks.get(key).unwrap();\n \n\t    let quantiy: f64 = value / cost_item;\n \n        profit_store += quantiy * (cost_item - *self.cost_for_items.drinks.get(key).unwrap());\n    }\n \n    for (key, value) in &amp;self.order.sides {\n        let cost_item: f64 = *self.menu_items.sides.get(key).unwrap();\n \n        let quantiy: f64 = value / cost_item;\n \n        profit_store += quantiy * (cost_item - *self.cost_for_items.sides.get(key).unwrap());\n    }\n \n    (cost_user, profit_store)\n}"},"7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-6":{"title":"DailyLog 6","links":["7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-5"],"tags":["7dit","dit"],"content":"Today\ncompleting Calculating profits\nI have edited the code a little to make it work how right making it return a vector than array just made it easier to use. but still has the same functionality.\nchanges// From \npub fn cost_profit(&amp;self) -&gt; (f64, f64) {\n\t...\n \n\t(user_cost, store profit)\n}\n \n// To\npub fn cost_profit(&amp;self) -&gt; Vec&lt;f64&gt; {\n\t...\n \n\tvec![user_cost, store profit]\n}\nI also added a doc string to the above function.\nFinaly I added some final toches to the cli and published the crate to crates.io and to docs.rs"},"7DIT/AS-91896-Coding-Project-2.7/Liams-Level-2-Python-Project":{"title":"Liams Level 2 Python Project","links":["7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-1","7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-2","7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-3","7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-4","7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-5","7DIT/AS-91896-Coding-Project-2.7/DailyLogs/DailyLog-6","7DIT/AS-91896-Coding-Project-2.7/Fixes-Post-Submit"],"tags":["7dit","dit"],"content":"Liams Level 2 Python Project\nProject Description\nCreate a Order system for a small bisness to display daliy earning profit excetra …\n\n\n                  \n                  Key Specifications \n                  \n                \n\nAdd orders\nremove orders\ndisplay the end of day resault\nDisplay the Orders and Menu …\nadd multiple to a order\n\n\nDaily Log\n\n\n                  \n                  Info\n                  \n                \nEach time you work on your project, add a dated entry to this section. Include brief details of what you did and any problems you encountered. Include screenshots of code and output.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nlogsLinksLog 1DailyLog 1Log 2DailyLog 2Log 3DailyLog 3Log 4DailyLog 4Log 5DailyLog 5Log 6DailyLog 6FixesFixes Post Submit\n\nFinal Project Files\nCode\n\n\n                  \n                  Info\n                  \n                \nInclude 2 versions of your final project:\n\nIn .py format (file name: your-name.py)\nA link to your CodeHS sandbox/repl for this project\n\n\n\n\ncrates.io\ndocs.rs\n\nTesting Plan\nMy testing plan (ctrl + k to add a hyperlink if you would like. Make sure the linked document is shared publicly)\nTesting Video\n\n\n\n\nHanding In Your Work\n\n\n                  \n                  Info\n                  \n                \nUse this checklist to ensure you have met key task requirements before handing in your project\n\nMy program uses all of these concepts:\n\n  Variables of at least 2 data types\n  If statements\n  Loops\n\nAnd at least two of the following:\n\n  Modifying data stored in lists (or arrays, dictionaries)\n  Storing multidimensional data in collections (2D lists)\n  Creating functions which use parameters and/or return values\n\nI have fully completed all project documentation, including:\n\n\n  Project description\n\n\n  Key specifications\n\n\n  Daily log\n\n\n  Testing plan\n\n\n  Testing video with narration\n\n\n  I have shared all documents so that my teacher can access them\n\n\n  My program includes comments\n\n\n  I have checked my code meets all PEP8 conventions by using this tool\n\n\n  I have saved my code as a .py file with an appropriate file name\n\n\n  I have embedded a link to my repl on this page\n\n\n💡 Authenticity Declaration\nI confirm that, for this project:\n\n  All of the work submitted is my own\n  I have not used AI generated code\n  I understand that I may be asked to explain the functionality of my code, and a reasonable level of understanding must be evident to meet the requirements of the Achievement Standard\n\n\n\n                  \n                  Info\n                  \n                \nOnce you have completed everything in this checklist, you are ready to hand in your work. Submit your work by email to your teacher. In your email, include:\n\n\nA link to this page (make sure it is shared to web)\n\n\nA PDF version of this page (scale to 70%)\n\n\n"},"7DIT/cool-class":{"title":"cool class","links":[],"tags":["7dit","dit"],"content":"This A Sick Class…"},"7ENF/2.9-Personal-Response":{"title":"2.9 Personal Response","links":["7ENF/BrainJack"],"tags":["7enf"],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTitleBrain JackAuthor/directorBrian FalknerText TypeNovelDate30/04/24NameLiam Tietjens\nIntroduction +  Theme/Idea\nBrain Jack is thought provoking take on digital warfare in set in dystopian version of the late 2010’s. The story follows a teenager who hacks his way in too highly secure systems over the course of the book. Homeland security finally catches up with him landing himself in a youth detention center for his crimes. This story shows you the disconnect between his actions and the world around him. The reproductions of his action felt disconnected because he wasn’t directly involved like a robbery.\nQuote 1\nThis quote showed me the weight of the story &quot;He was actually just trying to score a new computer and some other cool stuff, and in any case the words &quot;to its knees&quot; were the New York Times&#039; not his.&quot;. This quote shows me the impact he had on his surroundings. this shows the impact this had on others that he did not initially instantiate. For example if I were to do no work in a group project this would give me a free ride but the rest of the group would suffer. Holding them back and forcing them to pickup the slack therefore this allows me to relate to the situation.\nQuote 2\nA big moment in the story was &quot;At exactly 8.59 am, as Sam Wilson was walking through the main entrance to his school, nodding to the security guards-who ignored him - and smiling at their aggressive- looking guard dogs which snarled at him, a series of catastrophes was striking the largest telecommunications company in America: Telecomerica.&quot; This quote made me think of the systems i use. What would be the impact if a similar event happen you would be none the wiser of who did it. It could be your friend your neighbor. It demonstrates how faceless cyber crime can be. Sometimes I see a criminal hacker get arrested they look no different than any other computer geek. who in society we have assigned a stereotype of being harmless the truth is they are not."},"7ENF/BrainJack-Chapters/1.-Dirty-Tricks":{"title":"1. Dirty Tricks","links":[],"tags":["7enf"],"content":"Characters\n\nSam is introdused as a senior at high school who hacks for fun.\nFargas is Sam’s buddy who helps Sam with his hacking hobby.\n\nMain Points\nSam is introduced as making his way to a spot where they are going to hack. Sam, along the way, has to avoid beggars and during this self pined in to gamers alleyway by dogs. Once he makes it to the spot, he pulls out a gadget to hack his next target."},"7ENF/BrainJack-Chapters/10.-The-Wreck":{"title":"10. The Wreck","links":[],"tags":["7enf"],"content":"Characters\n\nSam\n\nMain\nFinds out about the detention center he is being held in. He maps and discovers the security measures he has to circumvent to escape the detention center. He has created a plan."},"7ENF/BrainJack-Chapters/2.-Telecomerica":{"title":"2. Telecomerica","links":[],"tags":["7enf"],"content":"Characters\n\nFragas is watch Sam From outside\nSam is in the coffie shop next to Telecomerica\n\nMain Points\nSam has posted up in the coffee shop next to Telelcomerica. He proceeds to hack their network changing the database. The staff of Telelcomerica realise what’s happening and try to catch him, but before they do, he’s waltz off down gone… Before the get the chance to catch him Sam arrives late to school."},"7ENF/BrainJack-Chapters/3.-Chaos":{"title":"3. Chaos","links":[],"tags":["7enf"],"content":"Characters\n\nSam: Walking into school\n\nMain Points\nThe down fall from the telecom database delletion cause mass panic. The computer virus spread down the coast lots of things broke"},"7ENF/BrainJack-Chapters/4.-URSULA":{"title":"4. URSULA","links":[],"tags":["7enf"],"content":"Characters\n\nSam: At his apartment\nFragas: At sam’s apartment\nGroup Of Bullies: Walks past Sam’s apartment\n\nMain Points\nThey recive there package containing there new nuro-tech headsets as they recive the package a group of bullies walk past and pester them. They then proseced to try them out and are greted with a computer assistant; This computer assistant gives them task to do that alow the device to learn what brain waves do what specificly beta brain waves."},"7ENF/BrainJack-Chapters/5.-Freaks-And-Geeks":{"title":"5. Freaks And Geeks","links":[],"tags":["6enf"],"content":"characters\n\nfragas\nsam\nskullface makeup dude\nrock chick bride\n\nMain Points\nFragas and Sam have found a invite to a hacker meet. They found this invite by hacking a email. They  try to not reval that they were behind the recent hack. Others say it was not posible but sam cant contain himself. He explains how it could be done. They all call his stupid so starts to storm off. But the skullface dude and rock chick bride stop him. They tell him that this is not the actual event the real event you have to hack to get into. the only clue they say is “white house”."},"7ENF/BrainJack-Chapters/6.-The-White-House":{"title":"6. The White House","links":[],"tags":["7enf"],"content":"Characters\nsam\nMain Plot\nexplains and executes a way to hack into the white houses inner air gap network. using a email exploit on the white houses email servers."},"7ENF/BrainJack-Chapters/7.--NEOH@CK":{"title":"7.  NEOH@CK","links":[],"tags":["7enf"],"content":"Characters\n\nSam\nUrsula His Ai Assistant\n\nMain Plot\nHe gets into the neoh@ck convention a virtual version of the white house. the meeting is a supposed formal dinner i this virtual white house. Sam found the application stored on a partition on a drive inside the whit house. He tries to enter the dinning room in the simulation the only thing he can interact with is a doorbell when he clicks the doorbell his doorbell rings."},"7ENF/BrainJack-Chapters/8.-KIWI":{"title":"8. KIWI","links":[],"tags":["7enf"],"content":"Characters\n\nSam\nJase - nickname: kiwi\n\nplot\nhe has found himself in a youth detention center after being taken by police. he gets a box of his items delivered from his mum. He goes outside for rec time and meets Jase a kid from new Zealand he has a nickname kiwi. Jase explains that there is a library with computers."},"7ENF/BrainJack-Chapters/9.-The-Library":{"title":"9. The Library","links":[],"tags":["7enf"],"content":"Charters\n\nSam\n\nMain Plot\nMeets a Rat faced boy with BadAss tattooed on his neckin the library using a computer. sam Goes to his own computer the futhest away and sends a quick email to his mum telling her hes safe. the computers wer locked down with only basic games and select approved sites. he begins to try to exploit the sheets application. he disabled the blocks on the computer then gained acceses to everything."},"7ENF/BrainJack":{"title":"BrainJack","links":["7ENF/BrainJack-Chapters/1.-Dirty-Tricks","7ENF/BrainJack-Chapters/2.-Telecomerica","7ENF/BrainJack-Chapters/3.-Chaos","7ENF/BrainJack-Chapters/4.-URSULA","7ENF/BrainJack-Chapters/5.-Freaks-And-Geeks","7ENF/BrainJack-Chapters/6.-The-White-House","7ENF/BrainJack-Chapters/7.--NEOH@CK","7ENF/BrainJack-Chapters/8.-KIWI","7ENF/BrainJack-Chapters/9.-The-Library","7ENF/BrainJack-Chapters/10.-The-Wreck","7ENF/BrainJack-Chapters/11.-Prison-Break"],"tags":["7enf"],"content":"Chapter 1\n\n\n                  \n                  Dirty Tricks \n                  \n                \nTransclude of 1.-Dirty-Tricks\n\n\nChapter 2\n\n\n                  \n                  Telecomerica \n                  \n                \nTransclude of 2.-Telecomerica\n\n\nChapter 3\n\n\n                  \n                  Chaos \n                  \n                \nTransclude of 3.-Chaos\n\n\nChapter 4\n\n\n                  \n                  Ursula \n                  \n                \nTransclude of 4.-URSULA\n\nChapter 5\n\n\n                  \n                  Freaks And Geeks \n                  \n                \nTransclude of 5.-Freaks-And-Geeks\n\nChapter 6\n\n\n                  \n                  The Library \n                  \n                \nTransclude of 6.-The-White-House\n\nChapter 7\n\n\n                  \n                  NEOH@CK \n                  \n                \nTransclude of 7.--NEOH@CK\n\nChapter 8\n\n\n                  \n                  KIWI \n                  \n                \nTransclude of 8.-KIWI\n\nChapter 9\n\n\n                  \n                  The Library \n                  \n                \nTransclude of 9.-The-Library\n\nChapter 10\n\n\n                  \n                  The Wreck \n                  \n                \nTransclude of 10.-The-Wreck\n\nChapter 11\n\n\n                  \n                  Prison Break \n                  \n                \nTransclude of 11.-Prison-Break\n"},"7ENF/Letter-To-Self":{"title":"Letter To Self (Draft 1)","links":[],"tags":["7enf"],"content":"12 Dear Year 9 Me\nWelcome to the big high school. As I’m you I got some advice because it will be a interesting experience to say the least.\nFriends\nI know your in a friend group from primary school, don’t get me wrong you know them, its makes it easy. But getting out of your comfort zone making new friends is a good thing. The current friend group is nothing compared to the people you will meet. Last year 2023 you and your future friends all went and stayed on pigeon island in the middle of the lake. Hopefully that’s enough persuasion to talk to some new people.\nplace Living\nJacks Point is a nice place to live much better than Auckland. Lately Auckland is really going down hill it now, there was a drive by shootings in Onehunga just the other day. Jacks Point  is great too because Hanleys Farm is just next door. You end up making a few friends that live there witch is nice because they are right there.\nInterests\nOver the next 4 years you spend a hole load of money on miscellaneous tech hobbies. There were a few cool ones and some that stuck. The one your about to get into is virtual reality this as cool as it is doesn’t stick around. There is a funny ending to this how ever after owning it for 9 months you sell it to Jodie for nearly full price. One of the coolest one that has stuck thus far is FPV drones, I understand if you need to make a google search to know what it is. You build your own drone from almost scratch a very cool experience to look forward to.\nFuture Highs And Lows\nI can say there is plenty to look forward too and to watch out for. One awesome trip to absolutely look forward to is pigeon island. Just after level 1 exams you and a group of your friends go out to the small island down Glenorchy way and stay in a small hut for 2 nights. We had the whole island to ourselves. There be be some lows ahead lessons to be learned. You will find out your super dyslexic, and get the long awaited knee surgery. The knee surgery turns into a good experience in hindsight. Having (a.c.c) pay for a wealth of services. The hospital is a big private hospital way cleaner than any other public one and a year of gym you will put to good use you wait!\nWhat Most Important To You?\nI would say at the moment the most important thing to me is my friendships. This has always been a priority even you now. Friend ships is something you will have to build its a skill. Friends will keep you in one piece when you reach your lows and celebrate your highs this goes both ways. I would also say another important thing to me are my hobbies pass times. Friends are number one but also hobbies like codding and electronics are important. These hobbies over the year have taught me more than you could imagine. If you really want to learn of become better at something you have to apply your self to getting better.\nWho Are You Now\nI think you’d be quite surprised at where your at in 3 years time somethings i’m sure you can guess a few. I think you’d be impressed with the level of Independence that you have now. Most mornings i catch the six am bus and go gym or I go into town with friends on the public bus. I almost never have to rely on mum or dad to shuttle me anymore except for work but that’s justified… The short you will become one of those weird older kids from the high school you would always avoid because they are scary. I mean i can’t say kids aren’t scared of me but its a hole different world when you get to my age, I think you will like it."},"7PED/AS-2.3-Report-Checklist":{"title":"AS 2.3 Report Checklist","links":[],"tags":["7ped"],"content":"Introduction\n\n Identify and describe your goal you set for yourself, which you focused on in your training programme. \n  Explain why you chose this goal based on your fitness levels at the time, your strengths, and weaknesses (you may include specific fitness components here).\n  Outline briefly your overall aims of your training programme. \n Outline any pre-testing you completed and make brief mention as to how you used this data to inform your training programme.\n\nBody of report writing points\nAchieved\n\n Provide a definition for each biophysical principle you have applied to your training.\n You must include at least two “Methods of Training” and two “Principles of Training”\n Explain “How” and “Why” each biophysical principle is applied in your training?\n Provide specific examples of your application of each biophysical principle from your experiences (during training and race day). \n\nMerit\n\n Provide a definition for each biophysical principle you have applied to your training.\n You must include at least two “Methods of Training” and two “Principles of Training” and either aspects of Sports Psychology or Exercise Physiology (energy systems).\n Explain fully “How” and “Why” each biophysical principle is applied to your training\n Explain how the biophysical principles you used in your training are interrelated. \n Provide specific examples of your application of each biophysical principle from your own \n Explaining “fully” may involve using a wider range of biophysical principles to evaluate your training. \n\nExcellence\n\n\n Provide a definition for each biophysical principle you have applied to your training.\n\n\n You must include at least two “Methods of Training” and two “Principles of Training” and either aspects of Sports Psychology or Exercise Physiology (energy systems).\n\n\n Explain fully “How” and “Why” each biophysical principle is applied to your training\n\n\n Evaluate by making judgments about the application of each biophysical principle to your training and the interrelationship between the principles you applied.\n\n\n Strengths and Weaknesses of the application of each biophysical principle.\n\n\n Least/Most beneficial biophysical principles applied to training and why.\n\n\n Changes/Modifications you would make to improve your training and why.\n\n\n Explain how the biophysical principles you used in your training are interrelated.\n\n\n Provide specific examples of your application of each biophysical principle from your experiences (during training and race day). \n\n\n Explaining “fully” may involve using a wider range of biophysical principles to evaluate your training.\n\n\nConclusion (for all levels)\n\n Overall, what was your experience of designing and following your training programme?\n What modifications/improvements/changes would you make to your training programme (think biophysical principles)  if you were to compete in the Wakatipu High School 5k Challenge again? Why would you make these changes?\n"},"7PED/AS-2.3-Report":{"title":"AS 2.3 Report","links":["7PED/AS-2.3-Report-Checklist"],"tags":["7ped"],"content":"Intro\nOver the course of my training program, my goal was to improve my time from 00:27:23 min 4.67 km to less than 27 minutes 5 km. This goal had taken in account for what I had thought to be achievable for the given limitations on time, training ability and current fitness level. Before the running training I had never properly trained for a running event or event for that matter. Therefore the primary focus was on cardio vascular performance and endurance.\nInfo:\n\nReport Check list: AS 2.3 Report Checklist\n"},"7PHX/2.4-Digital-Re-Take":{"title":"2.4 Digital Re-Take","links":[],"tags":["7phx"],"content":"Question One\n\n\n                  \n                  Question\n                  \n                \nTamsin wants to hit a tennis ball, with her tennis racket over the roof of her house.\n\na)\n\n\n                  \n                  Question\n                  \n                \nShe Accelerates the ball from rest velocity of 16ms^{-1}. It has a mass of 0.058kg. Determine the kenetic energy of the ball after it has been hit.\n\n\\begin{align}\nE_k&amp;=\\frac12mv^2\\\\\nE_k&amp;=\\frac12\\times0.058kg\\times(16ms^{-1})^2\\\\\nE_k&amp;=7.424J\n\\end{align}\nb)\n\n\n                  \n                  Question\n                  \n                \nwhen she hits the ball with a force of 13N her ball deforms (squashes). her tennis ball has a spring constant of 12\\times10^3Nm^{-1}. Calculate the elastic potential energy in the deformed tennis ball. Hint: Start by determining the distance the batt defoms when hit.\n\nSpring Constant\n\\begin{align}\nF&amp;=-Kx\\\\\nx&amp;=\\frac{F}{-K}\\\\\nx&amp;=\\frac{13N}{12\\times10^3Nm^{-1}}\\\\\nx&amp;=(1.083\\times10^{-3})\\space m\\\\\nx&amp;=1.083mm\n\\end{align}\nPotential Energy\n\\begin{align}\nE_p&amp;=\\frac12\\times(12\\times10^3)\\times(1.083\\times10^{-3})^2\\\\\nE_p&amp;=(7.037\\times10^{-3})J\n\\end{align}\nC) Check the [Acceleration] values.\n\n\n                  \n                  Question\n                  \n                \nThe ball travelling at 16ms^{-1} rebounds off a wall with a velocity of 14ms^{-1}. The time of interaction with the wall is 0.071s. Determine the change in momentum of the ball and the force on the wall. A complete answer should include the correct units and directions for both quantities.\n\nAcceleration\n\\begin{align}\nv_f&amp;=v_i+at\\\\\na&amp;=\\frac{v_f-v_i}{t}\\\\\na&amp;=\\frac{16ms^{-1}--14ms^{-1}}{0.071s}\\\\\na&amp;=422.535ms^{-2}\n\\end{align}\nForce\n\\begin{align}\nF&amp;=ma\\\\\nF&amp;=0.058kg\\times422.535ms^{-1}\\\\\nF&amp;=24.507N\n\\end{align}\nChange In Momentum\n\\begin{align}\n\\Delta P&amp;=F\\Delta t\\\\\n\\Delta P&amp;=24.507N\\times0.071s\\\\\n\\Delta P&amp;= 1.74J^{-1}\n\\end{align}\nD)\n\n\n                  \n                  Question\n                  \n                \nLater Tamsin is practicing her serve into a large padded wall next to the wall described in (C) above. When the ball strikes the padded wall it comes to a rest horizontally. Tasmin notices that the ball takes 1.0s to come to rest. Assume that the ball hits the pad at 16ms^{-1} horizontally. Discuss the force and the energy considerations involved in bringing the ball to rest horizontally. To stat with, calculate the force on the ball exerted by the padded wall, and compare this with the force on the ball exerted by the wall without padding.\n\nAcceleration\n\\begin{align}\nv_f&amp;=v_i+at\\\\\na&amp;=\\frac{v_f-v_i}{t}\\\\\\\\\na&amp;=\\frac{0ms^-1--16ms^{-1}}{1s}\\\\\na&amp;=16ms^{-1}\\\\\n\\end{align}\nForce\n\\begin{align}\nF&amp;=ma\\\\\nF&amp;=0.058kg\\times16ms^{-1}\\\\\nF&amp;=0.982N\n\\end{align}\nChange In Momentum\n\\begin{align}\n\\Delta P&amp;=F\\Delta t\\\\\\\\\n\\Delta P&amp;=0.982N\\times1s\\\\\n\\Delta P&amp;=0.982J\n\\end{align}\nQuestion 2\nA)\n\n\n                  \n                  Question\n                  \n                \nThe ball leves Tamsin’s racquet at 16ms^{-1} with an underarm serve at 0.84m height.\n\n\\begin{align}\nv_{v}&amp;=\\sin\\theta\\times v\\\\\nv_v&amp;=\\sin(40\\degree)\\times16ms^{-1}\\\\\nv_{v}&amp;=10.285ms^{-1}\\\\\\\\\nRo&amp;unded\\\\\nv_v&amp;=10ms^{-1}\n\\end{align}\n\nB) Dont Know what i did but the rearanged formual doesn&#039;t work.\n\n\n                  \n                  Question\n                  \n                \nThe bal leaves the racquet 0.85m above the ground. Determine the maximum height the ball can reach. (Initial velocity of 16ms^{-1}, 40\\degree from horizontal.)\n\nVertical Component\nTransclude of #^666574\nGravity Pulls at 9.8ms^{-2}\nFind the time\n\\begin{align}\na&amp;=\\frac{\\Delta v}{\\Delta t}\\\\\\\\\n\\Delta t&amp;=\\frac{\\Delta v}{a}\\\\\nor\\\\\n\\Delta t&amp;=\\frac{(v_f-v_i)}{a}\\\\\\\\\n\\Delta t&amp;=\\frac{(0ms^{-1}--10.285ms^{-1})}{9.8ms^{-2}}\\\\\n\\Delta t&amp;=1.049s\n\\end{align}\nFind The Distance\n\\begin{align}\nv_{f}^{\\space2}&amp;=v_{i}^{\\space2}+2ad\\\\\nd&amp;=\\frac{v_{f}^{\\space2}-v_{i}^{\\space2}}{2a}/2 \\\\\nd &amp; = \\frac{0ms^{-1}--10.285ms^{-1}}{22\\times9.8ms^{-2}} / 2 \\\\\nd &amp; = \n\\end{align}"},"7PHX/Task-A":{"title":"Task A","links":[],"tags":["7phx"],"content":"\n\n                  \n                  Question\n                  \n                \n\nIdentify and describe the forces acting on a dog on a lead. Draw a free body diagram and a vector diagram calculate the horizontal and vertical components of the force, if the tension force is 10 N and the angle is 30 degrees.\n\nDiagram\n\nMath\nSolved for the x and y components of the vector.\nF_x\n\\begin{align}\nsin(\\theta)&amp;=O/H\\\\\nsin(30) &amp;= O/10N\\\\\nsin(30)\\times10N &amp;= O\\\\\n5&amp;=O\\\\\n\\end{align}\nF_x=5\nF_y\n\\begin{align}\ncos(\\theta)&amp;=A/H\\\\\ncos(\\theta)\\times H&amp;=A\\\\\ncos(30)\\times10N&amp;=A\\\\\n8.66^{(3sf)}&amp;=A\\\\\n\\end{align}\nF_y=8.66^{(3sf)}"},"7PHX/Task-B":{"title":"Task B","links":[],"tags":[],"content":"\n\n                  \n                  Question\n                  \n                \nIdentify and describe the forces acting on a child sitting at the top of a slide. Draw a diagram to show all the forces acting on the child, then draw the same forces as a vector diagram.\nTask 2: Momentum and impulse\n\n\nChoose an example to explain the idea of conservation of momentum.   You can use the examples below to help you. (you can present this in any format of your choice, a written synopsis must be provided for any recordings.\n\n\nChoose an example of impulse (maybe linked to your first example) and describe and explain the key physics ideas.\n\n\n\nIn football, when one player tackles another, they exchange momentum. This follows the rule that momentum stays the same unless something outside affects it. Before the tackle, both players have momentum from their movements. During the tackle, they transfer momentum. Afterward, the total momentum remains constant. Understanding this helps players and coaches predict tackles and reduce injuries by managing collision force."},"7PHX/VERBILISE-IT":{"title":"VERBILISE IT","links":[],"tags":[],"content":"torke\nforce by the distance form pivot\n\\tau=Fd\nEquilibrium\nWhen forces are equal aka net force of zero\n\\Sigma F=0\n(F_{up}=F_{down}) all vertical forces must be equal\n(F_{left}=F_{right}) all horizontal forces must also be equal."},"7PHX/electicity/Colomb":{"title":"Colomb","links":[],"tags":["7phx"],"content":"What is a Colomb\nColomb is a unit of electrons 1c=6\\times 10^{5} \\space elctrons"},"7PHX/electicity/Fields-Question-Practice":{"title":"Fields Question Practice","links":[],"tags":["7phx"],"content":"\n\n                  \n                  Question\n                  \n                \n\n\nb)\nThe field is uniform\nc) ii)\n\\begin{align}\nF_{w}&amp;=(5.87\\times 10^{-10}kg)\\times 9.8ms^{-2} \\\\\nF_{w}&amp;=5.75\\times 10^{-9}N \\\\\n \\\\\nE&amp;=\\frac{V}{d} \\\\\nE&amp;=\\frac{240}{2.00\\times 10^{-2}m} \\\\\n \\\\\nF&amp;=Eq \\\\\nq&amp;=\\frac{F}{E} \\\\\nq&amp;=\\frac{5.75\\times 10^{-9}}{1.2\\times 10^{4}} \\\\\nq&amp;=4.79\\times 10^{-13} \\\\\n \\\\\nNumber\\space of\\space elementry\\space charges&amp;= \\frac{q}{elementry\\space charge} \\\\\nNumber\\space of\\space elementry\\space charges&amp;= \\frac{4.79\\times 10^{-13}}{1.61\\times 10^{-19}} \\\\\nNumber\\space of\\space elementry\\space charges&amp;= 2.98\\times 10^{6}\n\\end{align} "},"7PHX/electicity/Magnet-Fields":{"title":"Magnet Fields","links":[],"tags":["7phx"],"content":"Field Force\nHow we define the force of repletion / attraction\n\\begin{align}\nF&amp;=Eq \\\\ \\\\\nF&amp;or\\space Example: \\\\ \\\\\nE&amp;=80\\times 10^{3}Vm^{-1} \\\\\nq&amp;=3.2\\times 10^{-19} \\\\ \\\\\nF&amp;=(80\\times 10^{3}Vm^{-1})\\times (3.2\\times 10^{-19} ) \\\\\nF&amp;=2.56\\times 10^{-14}N\n\\end{align}\nField Strength\n\\begin{align}\nE&amp;=\\frac{V}{d} \\\\\n \\\\\nV&amp;=1.34\\times 10^{3}\\space V \\\\\nd&amp;=0.06m  \\\\\n\\\\\nE&amp;=\\frac{1.34\\times 10^{3}\\space V }{0.06m} \\\\\nE&amp;=2.2\\times 10^{3}Vm^{-1}\n\\end{align}"},"7PHX/electicity/index":{"title":"Electricity & Magnetism","links":["7PHX/electicity/Colomb","Ohms","Current","Voltage","Wats","conventional-curent","Static-Electricity","Current-Electricity"],"tags":["7phx"],"content":"Units\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nnameuseunitColombAmount of chargecOhmsResistance\\Omega or RCurrentElectron Flow Of negitive chargesIVoltageDifference of chargeVWatsShow the powerw or Js^{-1}Conventional CurentElectron Flow Of positive chargesI\nTypes Of Electricity\n\nStatic Electricity\nCurrent Electricity\n"},"Html-tags":{"title":"Html tags","links":[],"tags":["6dit","web","dit"],"content":"“ paragrph\n&lt;p&gt;\n\ttext goes here.\n&lt;/p&gt;\n&lt;div&gt; devider\n&lt;div&gt;\n\ttext and elements go here\n&lt;/div&gt;\n&lt;style&gt; style tag for css in file\n&lt;style&gt;\n\t.body{\n\t\t/* styling can go here. */\n\t}\n&lt;/style&gt;\n&lt;img&gt; image tag\n&lt;img src=&quot;link or path to image&quot; alt=&quot;what shows on hover &quot;&gt;\n&lt;a&gt; link tag\n&lt;a href=&quot;sub.fqdn.tldn&quot;&gt;the link text&lt;/a&gt;\n&lt;em&gt; same as * * in markdown its italics\n&lt;em&gt; emthsized text (italics)\n&lt;ul&gt; unordered-list\n&lt;ul&gt;\n\t&lt;li class=list_class&gt;item&lt;/li&gt;\n\t...\n&lt;/ul&gt;\n&lt;li&gt; list item\n&lt;ul&gt;\n\t&lt;li class=list_class&gt;item&lt;/li&gt;\n\t...\n&lt;/ul&gt;\n&lt;br&gt; break or line break same as \\n\ntext on the first line &lt;br&gt; now im on the second line \n&lt;iframe&gt; for embeds or including other websites\n&lt;iframe id=&quot;inlineFrameExample&quot;\n    title=&quot;Inline Frame Example&quot;\n    width=&quot;300&quot;\n    height=&quot;200&quot;\n    src=&quot;link to embed&quot;&gt;\n&lt;/iframe&gt;\n&lt;ol&gt; ordered list\n&lt;ol&gt;\n\t&lt;li class=list_class&gt;item&lt;/li&gt;\n\t...\n&lt;/ol&gt;"},"Ncea-3.7-Assesment-Project-Proposals":{"title":"Ncea 3.7 Assesment Project Proposals","links":["kuberneties"],"tags":["dit"],"content":"API\nI could make a Web Api using Python and Module i have had some time with FastApi. I have spent a fair amount of time with kuberneties Witch i can use to deploy the app to a public domain. I could also build a frontEnd/user Interface for this api."},"Voltage":{"title":"Voltage","links":[],"tags":["7phx"],"content":"electric potential energy per charge"},"cellular-reproduction":{"title":"cellular reproduction","links":[],"tags":["6sce","bio"],"content":"binary fission\nbinary fision; binary meaning x^2 as when it splits the posible population incenses by a factor of x^2\n\nExplaintion\n\nIn this stage of the life cycle is where the Dna or more specifically the nuleoid is replicated for use in the replica cell. The copy of the nucleoid is a 1 for 1 match as it can be this mean there is no perent as each cell is just as much of the cell as the one is split off.\nThe cell starts to enlarge in this process it would be producing more of other organales e.g. plasmids ribosomes and others this way there are more resources for whent the cells split the resources in half.\nThe cell has grown to the point of witch it now starts to seal the two cell off getting ready to split from one another. \nThe cell now has sealed and the membrain and cell wall have closed at this stage it is almost time for the cells to split from one another.\nThe cells now have finally split into 2 from the before 1 importantly these cells are identical in every way or at least very close. This is because in bacteria they have n o parent just a split, making the two cells almost like brothers instead of parent and child.\n\n"},"divergent":{"title":"divergent","links":["family-relationships","jojo-rabit-(movie)","the-sniper","war-is-damaging","genocide","factions"],"tags":["movie","divergent","6enf"],"content":"SKIP to important Themes at the end of the film\nintro to factions\nAfter picking their factions they do challenges to prove there belong to there correlating factions.\nin the case of the protagonist in the dauntless faction, she has to climb up to a train as the first part of the test. They then have to jump to a rooftop slong side the train line. You get the idea you have to do an arry of tasks to prove you have what it takes.\nTraning\nthey are told that there is a new rule that the lowest preforming puples of the class will become factionless. when she was put in a ring with a pure dauntless she had other quality of the other factions as she is a divergent meaning quality of a range of factions. Like empathy which stops her from putting in her all to defeat her opponent. at the tatto parla she see the person who tested her and knows shes a divergent see her agin gives her newly found confidence and trains harder than before. 4 the trainer starts to show a nicer side of his personality giving tips and showing he may be more than a dauntless war machine.\nWar games\nshe runs from the infermory to the train on the way to the war games 4’s first choice as a captain is the protagnest as he see she has other quaitys other than being a grunt like the full dauntles’s.\nshe shows one of these quaity in climbing to have a look out this shows her smarts. this allows her team to win the war game.\nParents divergent\nthis scene shows family relationships being broken or provoked as she is different compared to the others that are pure one faction. They fell intimidated of whom that can have many character defining traits.\nThe erudite trying to rule the government\nthe erudite are try to take place of the abnegation. As they have been trying and trying to dehumanise everyone and turn them against human nature so that they have a dependence on them. Becuse the way an evil can build control through dependence.\nPropaganda at work\nbecause of the fear caused by becoming factionless, this fear is induced by the dependence of the status to live a meaningful life according to the propaganda. When kids have this values instilled apon them from birth, these values often last life times as a kid cannot make their own disistions for them selfs.\n4 &amp; protagonist go for a trip\n4 and the protagonist go for a trip together. Shows the protagonist how to blend in to how a dauntless would do things to avoid being caught. Becuse she has the traits of other factions, she could easily be caught if they see she’s using these skills she shouldn’t have.\n4\n4 is a divergent just like the protagonist by learning the morals of each faction. He shows his back which has every faction on it, showing he wants to earn the traits of each.\nFinal test\nthe final test is important becuse she has to fight her fares fast and without susption of her being a divergent. her being sexualy abused was in that final test with the love interest of the protagnest. she also had to kill a meber of her family duing the scene\nThe serum\nthey all got injected with a transplant after that controls them so they have formed a mindless army. the protagonist has to try her best to blend in as the transplant didn’t work. she find 4 who is also just blending in as he is also now a divergent\ngeting caught\nthey get singled out, and they are tested buy a gun almost being shot at 4 head. they got caught by trris holding a gun to there heads ot them caught then the mum free them. they fight back as they are being chaced by meny mindless drones of humans. the mum dies as they cross a wide open road.\nControlling system\nthey have a control system inside the dauntless base. She sees 4 who has been taken over. She breaks the mind control by using love, just like a classic movie love tale. Furthermore, she then holds the leader of erudite, who is controlling everyone. They then made her shutdown the system now everyone is free again but the leaders of the dauntless have the same thoughts as the erudite.\nThemes at the end of the film\nfamily relationships\nfamily relationships are tested and people are lost. Both the dad and mum of Betris (protagonist) die while fighting for the betterment of the city. This is true of jojo rabit (movie) and the sniper where they all have an immediate family member die due to a conflict. In the text the sniper, it was a political civil war. These all have propaganda at their core to cause the conflict.\nwar is damaging\noThis film shows how war/conflicts can be damaging, hurting and often unnecessary homicide or mass genocide. This links into family relationships as this is the result of this damage. War causes families to turn on themselves or even kill each other, that’s in the case of the sniper he kills his brother unknowingly. Genocide applys quite well to the intent of the erudite the intelgens of the cosiety wanted to put themself in power. they had thought that the only way was to wipe out the law makers of the city causing a genocide.✍️\nTransclude of factions"},"factions":{"title":"factions","links":[],"tags":["6enf","movie","divergent"],"content":"candor\nhonest \n\ndauntless\nthe brave\n\nerudite\nintelgence\n\namity\nkind \n\nAbnegation\nselfless\n"},"index":{"title":"Home Of Liam's Notes","links":[],"tags":["6enf","6sce","bio","chem","dit","6dit","7phx","7enf","7che","7ped"],"content":"WOW I Am Sooooooo Good At School Check Out My 10/10 Cheat Codes !!!\nThey work most if not none of the time 👍👍👍"},"kubernetes":{"title":"kubernetes","links":[],"tags":["dit"],"content":"How I Use kubernetes\nI use kubernetes mostly in my CD pipeline I also have deployed other servieces like bitwarden a password manager too.\nContinuous Deployment (CD)\nThe main service that makes continuous deployment work for me is ArgoCd. ArgoCd reads and deploys my apps from the kubernetes manifest if you don’t know are similar to docker compose files"},"pe-journal-format":{"title":"pe journal format","links":[],"tags":["6ped"],"content":"Structure\nWHAT: &lt; what factors applied &gt;\nHOW:  &lt; how did this affect you &gt;\nWHY: &lt; Why you think this had a impact &gt;\nNEXT TIME: &lt; What you would change for next time &gt;\nWhen has been used\nI used this two times during my 6ped course on the 1.1 and 1.5 assessments where we keep journals after each practical activity. i could see this format of jornals being usefull not only for futre assesments i would like to implemnt it into something i do on my own time."},"pi-Api/Add-To-Your-Project":{"title":"Add To Your Project","links":[],"tags":["piApi","dit"],"content":"Add This Module\n\nRun the following CLI commands\n\ngit submodules init\ngit submodules update --remote # updates the submoule with the \n\nCreate a .gitmodules file in the root\n\n[submodule &quot;piApi&quot;]\n\tpath = piApi\n\turl = github.com/Notliam99/piApi.git\n\tbranch = builds\nThe Project directory"},"pi-Api/Demo":{"title":"Demo","links":[],"tags":["github","piApi","dit"],"content":"Demo\nSimple demo script is included in the Github repository here: main.py\nmain.pyfrom piApi import Api\n \n \napi = Api()\n \n \n@api.get(&#039;/&#039;)\ndef hello_world(request):\n    &quot;&quot;&quot;\n        Index route decorated by @api.get()\n        ARGS:\n            request: dict # contains the parsed request\n        RETURNS:\n            document: str\n            responce_code: int # optional\n            custom_headers: dict # optional Requries( responce_code )\n    &quot;&quot;&quot;\n    doc = f&#039;&#039;&#039;\n        &lt;center&gt;\n            &lt;h1&gt;Hello World&lt;h1&gt;\n            &lt;hr&gt;\n            &lt;p&gt;{request}&lt;/p&gt;\n        &lt;/center&gt;\n    &#039;&#039;&#039;\n    return doc, 200\n \n \ndef Main():\n    api.run(80)\n \n \nif __name__ == &#039;__main__&#039;:\n    Main()"},"pi-Api/Module":{"title":"Module","links":[],"tags":["piApi","dit"],"content":"Add This Module\nUsing Git\nCreate\n[submodule &quot;piApi&quot;]\n\tpath = piApi\n\turl = github.com/Notliam99/piApi.git\n\tbranch = builds\nRun the following commands\ngit submodules init\ngit submodules update --remote # updates the submoule with the "},"pi-Api/Pi-Api":{"title":"Pi-Api","links":["pi-Api/Demo"],"tags":["github","piApi","dit"],"content":"Pi-API is a simple module made for micro Python.  to make simple web enabled projects use it to integrate with your own code.\nDemo\nMore Documentation To Be Done"},"semantic-html":{"title":"semantic html","links":["semantic-css","Html-tags"],"tags":["6dit","web","dit"],"content":"Semantic is a style to your html along with this your css will have to be formated in a way that makes in easy to work with this.\nHTML\nThe html uses some new Html tags that i havent seen before\n&lt;body&gt;\n\t&lt;header&gt;\n\t\t&lt;section&gt;\n\t\t\t&lt;head&gt;WEBSITE&lt;/head&gt;\n\t\t&lt;/section&gt;\n\t\t&lt;section&gt;\n\t\t\t&lt;nav&gt;\n\t\t\t\t...\n\t\t\t&lt;/nav&gt;\n\t\t&lt;/section&gt;\n\t&lt;/header&gt;\n\t&lt;main&gt;\n\t\t&lt;section&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t&lt;/section&gt;\n\t\t&lt;section&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t&lt;/section&gt;\n\t&lt;/main&gt;\n\t&lt;footer&gt;\n\t\t&lt;section&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t\t&lt;div&gt;\n\t\t\t\t...\n\t\t\t&lt;/div&gt;\n\t\t&lt;/section&gt;\n\t&lt;/footer&gt;\n&lt;/body&gt;\nWHY\nIts to organsise your you code into blocks kind of like object orentend programing pardimes in othe langwages but less readable. by coding in this way it allows you to work on one part at a time. just like in functions in other langwages where you can work on one part at a time."},"the-sniper":{"title":"the sniper","links":["family-relationships"],"tags":["6enf","movie"],"content":"Explain the general plot\none theme of this theme of this short storey is the pretrail of family relationships that are ruined with the protagnists brother.\nstory\nThe long June twilight faded into night. Dublin lay enveloped in darkness but for the dim light of the moon that shone through fleecy clouds, casting a pale light as of approaching dawn over the streets and the dark waters of the Liffey. Around the beleaguered Four Courts the heavy guns roared. Here and there through the city, machine guns and rifles broke the silence of the night, spasmodically, like dogs barking on lone farms. Republicans and Free Staters were waging civil war.\nOn a rooftop near O’Connell Bridge, a Republican sniper lay watching. Beside him lay his rifle and over his shoulders was slung a pair of field glasses. His face was the face of a student, thin and ascetic, but his eyes had the cold gleam of the fanatic. They were deep and thoughtful, the eyes of a man who is used to looking at death.\nHe was eating a sandwich hungrily. He had eaten nothing since morning. He had been too excited to eat. He finished the sandwich, and, taking a flask of whisky from his pocket, he took a short drought. Then he returned the flask to his pocket. He paused for a moment, considering whether he should risk a smoke. It was dangerous. The flash might be seen in the darkness, and there were enemies watching. He decided to take the risk.\nPlacing a cigarette between his lips, he struck a match, inhaled the smoke hurriedly and put out the light. Almost immediately, a bullet flattened itself against the parapet of the roof. The sniper took another whiff and put out the cigarette. Then he swore softly and crawled away to the left.\nCautiously he raised himself and peered over the parapet. There was a flash and a bullet whizzed over his head. He dropped immediately. He had seen the flash. It came from the opposite side of the street.\nHe rolled over the roof to a chimney stack in the rear, and slowly drew himself up behind it, until his eyes were level with the top of the parapet. There was nothing to be seen—just the dim outline of the opposite housetop against the blue sky. His enemy was under cover.\nJust then an armored car came across the bridge and advanced slowly up the street. It stopped on the opposite side of the street, fifty yards ahead. The sniper could hear the dull panting of the motor. His heart beat faster. It was an enemy car. He wanted to fire, but he knew it was useless. His bullets would never pierce the steel that covered the gray monster.\nThen round the corner of a side street came an old woman, her head covered by a tattered shawl. She began to talk to the man in the turret of the car. She was pointing to the roof where the sniper lay. An informer.\nThe turret opened. A man’s head and shoulders appeared, looking toward the sniper. The sniper raised his rifle and fired. The head fell heavily on the turret wall. The woman darted toward the side street. The sniper fired again. The woman whirled round and fell with a shriek into the gutter.\nSuddenly from the opposite roof a shot rang out and the sniper dropped his rifle with a curse. The rifle clattered to the roof. The sniper thought the noise would wake the dead. He stooped to pick the rifle up. He couldn’t lift it. His forearm was dead. “I’m hit,” he muttered.\nDropping flat onto the roof, he crawled back to the parapet. With his left hand he felt the injured right forearm. The blood was oozing through the sleeve of his coat. There was no pain—just a deadened sensation, as if the arm had been cut off.\nQuickly he drew his knife from his pocket, opened it on the breastwork of the parapet, and ripped open the sleeve. There was a small hole where the bullet had entered. On the other side there was no hole. The bullet had lodged in the bone. It must have fractured it. He bent the arm below the wound. The arm bent back easily. He ground his teeth to overcome the pain.\nThen taking out his field dressing, he ripped open the packet with his knife. He broke the neck of the iodine bottle and let the bitter fluid drip into the wound. A paroxysm of pain swept through him. He placed the cotton wadding over the wound and wrapped the dressing over it. He tied the ends with his teeth.\nThen he lay still against the parapet, and, closing his eyes, he made an effort of will to overcome the pain.\nIn the street beneath all was still. The armored car had retired speedily over the bridge, with the machine gunner’s head hanging lifeless over the turret. The woman’s corpse lay still in the gutter.\nThe sniper lay still for a long time nursing his wounded arm and planning escape. Morning must not find him wounded on the roof. The enemy on the opposite roof covered his escape. He must kill that enemy and he could not use his rifle. He had only a revolver to do it. Then he thought of a plan.\nTaking off his cap, he placed it over the muzzle of his rifle. Then he pushed the rifle slowly upward over the parapet, until the cap was visible from the opposite side of the street. Almost immediately there was a report, and a bullet pierced the center of the cap. The sniper slanted the rifle forward. The cap clipped down into the street. Then catching the rifle in the middle, the sniper dropped his left hand over the roof and let it hang, lifelessly. After a few moments he let the rifle drop to the street. Then he sank to the roof, dragging his hand with him.\nCrawling quickly to his feet, he peered up at the corner of the roof. His ruse had succeeded. The other sniper, seeing the cap and rifle fall, thought that he had killed his man. He was now standing before a row of chimney pots, looking across, with his head clearly silhouetted against the western sky.\nThe Republican sniper smiled and lifted his revolver above the edge of the parapet. The distance was about fifty yards—a hard shot in the dim light, and his right arm was paining him like a thousand devils. He took a steady aim. His hand trembled with eagerness. Pressing his lips together, he took a deep breath through his nostrils and fired. He was almost deafened with the report and his arm shook with the recoil.\nThen when the smoke cleared, he peered across and uttered a cry of joy. His enemy had been hit. He was reeling over the parapet in his death agony. He struggled to keep his feet, but he was slowly falling forward as if in a dream. The rifle fell from his grasp, hit the parapet, fell over, bounded off the pole of a barber’s shop beneath and then clattered on the pavement.\nThen the dying man on the roof crumpled up and fell forward. The body turned over and over in space and hit the ground with a dull thud. Then it lay still.\nThe sniper looked at his enemy falling and he shuddered. The lust of battle died in him. He became bitten by remorse. The sweat stood out in beads on his forehead. Weakened by his wound and the long summer day of fasting and watching on the roof, he revolted from the sight of the shattered mass of his dead enemy. His teeth chattered, he began to gibber to himself, cursing the war, cursing himself, cursing everybody.\nHe looked at the smoking revolver in his hand, and with an oath he hurled it to the roof at his feet. The revolver went off with a concussion and the bullet whizzed past the sniper’s head. He was frightened back to his senses by the shock. His nerves steadied. The cloud of fear scattered from his mind and he laughed.\nTaking the whiskey flask from his pocket, he emptied it a drought. He felt reckless under the influence of the spirit. He decided to leave the roof now and look for his company commander, to report. Everywhere around was quiet. There was not much danger in going through the streets. He picked up his revolver and put it in his pocket. Then he crawled down through the skylight to the house underneath.\nWhen the sniper reached the laneway on the street level, he felt a sudden curiosity as to the identity of the enemy sniper whom he had killed. He decided that he was a good shot, whoever he was. He wondered did he know him. Perhaps he had been in his own company before the split in the army. He decided to risk going over to have a look at him. He peered around the corner into O’Connell Street. In the upper part of the street there was heavy firing, but around here all was quiet.\nThe sniper darted across the street. A machine gun tore up the ground around him with a hail of bullets, but he escaped. He threw himself face downward beside the corpse. The machine gun stopped.\nThen the sniper turned over the dead body and looked into his brother’s face."}}